/* Codded by @phaticusthiccy
Telegram: t.me/phaticusthiccy
Instagram: www.instagram.com/kyrie.baran
Special Thanks:
@PrensesdcBot for soruce!
@bberc for soruce!
@1305025157 for ideas!
And other helpers...
*/

const Asena = require('../events');
const {MessageType} = require('@adiwajshing/baileys');
const cof = require('../config');

const rep = "*කරුණාකර ඕනෑම පරිශීලකයෙකුගේ පණිවිඩයකට පිළිතුරු දෙන්න!*"
const SURO = {
    none: 'ඔබේ මිතුරන්ගෙන් ඇසීමට හොඳ සහ සිතට කාවදින ප්‍රශ්න.',
    challenge: 'වෙනදාට වඩා අභියෝගාත්මක ප්‍රශ්න සඳහා සූදානම් වන්න.',
    sex: '+18 සත්‍ය ප්‍රශ්න අසයි.',
    lgbt: 'LGBT ගැටළු ගැන අසයි'
};

if (cof.WORKTYPE == 'public') {
    Asena.addCommand({pattern: 'suro', fromMe: false, desc: SURO.none}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid, rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *මෙන්න ගැටලුව පැමිණේ ..* 🤭 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
  r_text [0] = " * ඔබ ඔබගේ දුරකථනයෙන් අවසන් වරට සෙවුයේ කුමක්ද? *";
     r_text [1] = " * ඔබේ පෙම්වතිය / පෙම්වතා සමඟ වෙන්වීමට යමෙකු ඔබට ඩොලර් මිලියනයක් ලබා දුන්නේ නම්, ඔබ එය කරන්නෙහිද? *";
     r_text [2] = " * ඔබ කවදා හෝ යමක් ගෙන එය කෑවාද *";
     r_text [3] = " * ඔබට සර්පයන් හෝ ගෙම්බන් වැනි දේ ආහාරයට ගැනීමට සිදු වූවාද? *";
     r_text [4] = " * ඔබ විරුද්ධ ලිංගයේ අයෙකු ලෙස එක් දිනක් අවදි වුවහොත් ඔබ කරන පළමු දෙය කුමක්ද *";
     r_text [5] = " * ඔබට මන anකල්පිත මිතුරෙකු වැඩෙමින් සිටියාද? *";
     r_text [6] = " * ඔබේ නරකම පුරුද්ද කුමක්ද? *";
     r_text [7] = " * ඔබට නාන කාමරයේ ගායනා කළ හැකිද? *";
     r_text [8] = " * සමාජය තුළ ඔබ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද? *";
     r_text [9] = " * ඔබ කවදා හෝ කැඩපත තුළ ඔබ සමඟම කතා කර තිබේද? *";
     r_text [10] = " * ඔබේ වෙබ් ඉතිහාසය යමෙකු දුටුවහොත් ඔබ ලැජ්ජා වන්නේ කුමක් ද? *";
    r_text [11] = " * ඔබ නින්දේදී කතා කරනවාද? *";
    r_text [12] = " * ඔබට පෞද්ගලිකව ලියූ කෙනෙකුට ඔබ අවසන් වරට යැවූ පණිවිඩය කුමක්ද? *";
    r_text [13] = " * ඔබ කියූ හෝ කළ දෙයක් මකා දැමීමට ඔබට අතීතයට යාමට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [14] = " * ඔබ නැවත ඉපදුණේ නම්, ඔබ කුමන සියවසේ ඉපදීමට කැමතිද? *";
    r_text [15] = " * ඔබ තවමත් කරන බොළඳ දේ කුමක්ද? *";
    r_text [16] = " * ඔබට නැවත නැවතත් නැරඹිය හැකි ළමා චිත්‍රපටය කුමක්ද? *";
    r_text [17] = " * ඔබට මෝඩ අන්වර්ථ නාම තිබේද? *";
    r_text [18] = " * ඔබ වැඩිපුරම කාලය වැය කරන්නේ ඔබේ දුරකථනයේ කුමන යෙදුමේද? *";
    r_text [19] = " * එකවර වාඩි වී වැඩිපුරම ආහාරයට ගත් ආහාරය කුමක්ද? *";
    r_text [20] = " * ඔබ තනිව නටනවාද? *";
    r_text [21] = " *ඔබ අඳුරට බියද? *";
    r_text [22] = " *ඔබ දවස මුළුල්ලේ ගෙදර සිටියා නම් ඔබ කුමක් කරන්නේද? *";
    r_text [23] = " *ඔබ දිනකට සෙල්ෆි කීයක් ගන්නවාද *";
    r_text [24] = " *ඔබ අවසන් වරට දත් මදින්නේ කවදාද? *";
    r_text [25] = " *ඔබේ ප්‍රියතම පිජාමා පෙනුම කෙබඳුද *";
    r_text [26] = " *නොකළ යුතු දෙයක් කරමින් ඔබ කිසි දිනෙක හසු වී තිබේද? එසේ නම් ඔබ කළේ කුමක්ද *";
    r_text [27] = " * ඔබ ඔබේ ශරීරයේ කුමන කොටසට කැමතිද, කුමන කොටසට වෛර කරනවාද? *";
    r_text [28] = " * ඔබට කවදා හෝ දෂ්ට කර තිබේද? *";
    r_text [29] = " * විලාසිතා සඳහා ඔබ කවදා හෝ ඔබේ කලිසම කපා දමා තිබේද? *";
    r_text [30] = " * ඔබ ඔබේ පිඟාන ලෙවකනවාද? *";
    r_text [31] = " * ඔබ ගැන කිසිවෙකු නොදන්නා යමක් තිබේද? *";
    r_text [32] = " * ඔබ මෙම කණ්ඩායමේ සියල්ලන්ම දැවෙන ගොඩනැගිල්ලකින් බේරා ගැනීමට උත්සාහ කළහොත් ඔබට යමෙකු හැර යාමට සිදු වූවා නම්, ඔබ හැර යන්නේ කවුරුන්ද? *";
    r_text [33] = " * ඔබ දුරකථනයෙන් අවසන් වරට සෙව්වේ කුමක්ද? *";
    r_text [34] = " * ඔබට සෝපානයේ ගෑස් නැති වී තිබේද? *";
    r_text [35] = " * ඔබ නාන කාමරයේ සිටියදී අහම්බෙන් කවුරුන් හෝ කඩා වැදුනේද? *";
    r_text [36] = " * ඔබ දිනකට විරුද්ධ ලිංගයේ අය නම් ඔබ මොකද කරන්නේ? *";
    r_text [37] = " * ඔබේ ජීවිතයේ එක් දෙයක් වෙනස් කිරීමට ඔබට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [38] = " * ඔබේ ලොකුම කනගාටුව කුමක්ද? *";
    r_text [39] = " * ඔබ කිසිවෙකුට සොයා ගත නොහැකි නරක දෙයක් කළාද? *";
    r_text [40] = " * ඔබගේ දුරකථනයේ ඇති අපහසුතාවයට පත් වූ ඡායාරූපය කුමක්ද? *";
    r_text [41] = " * ඔබ මෙතෙක් දැක ඇති බියකරු සිහිනය කුමක්ද? *";
    r_text [42] = " * මේස් මාරු කිරීමේදී ඔබේ දෙපා සුවඳ දැනෙනවාද? *";
    r_text [43] = " * සම්බන්ධතාවයකදී ඔබේ ලොකුම බිය කුමක්ද? *";
    r_text [44] = " * ඔබේ වයස ගැන ඔබ කවදා හෝ බොරු පවසා තිබේද? *";
    r_text [45] = " * ඔබේ විනෝදකාමී පළමු දිනය කුමක්ද? *";
    r_text [46] = " * ඔබේ අමුතුම පුරුද්ද කුමක්ද? *";
    r_text [47] = " * ඔබ දරුවන් කී දෙනෙක් ලැබීමට කැමතිද? *";
    r_text [48] = " * ඔබේ ළමා කාලයේ අන්වර්ථ නාමය කුමක්ද? *";
    r_text [49] = " * ඔබේ ප්‍රියතම ආහාරය කුමක්ද? *";
    r_text [50] = " * ඔබේ සිහින රැකියාව කුමක්ද? *";
    r_text [51] = " * ඔබ දින 3 ක් දූපතක සිරවී සිටී නම් ඔබ කුමක් කරන්නේද? *";
    r_text [52] = " * ඔබේ ප්‍රියතම පුද්ගලයා කවුද සහ ඇයි? *";
    r_text [53] = " * බැලූ බැල්මට ඔබ ආදරය විශ්වාස කරනවාද? *";
    r_text [54] = " * ඔබ ආදරය විශ්වාස කරනවාද? *";
    r_text [55] = " * ඔබට අවස්ථාවක් ලැබුනහොත් ඔබ ජීවත් වීමට කැමති කුමන රටේද? *";
    r_text [56] = " * ඔබේ සිහින මංගල උත්සවය කුමක්ද? *";
    r_text [57] = " * ඔබ දුටු අමුතුම සිහිනය විස්තර කළ හැකිද? *";
    r_text [58] = " * ඔබේ ලොකුම කනගාටුව කුමක්ද? *";
    r_text [59] = " * ඔබේ හිස සෝදා නොගෙන කොපමණ වේලාවක් බලා සිටියාද? *";
    r_text [60] = " * ඔබට කිසියම් ප්‍රසිද්ධ පුද්ගලයෙක් සමඟ විවාහ විය හැකි නම් ඒ කවුරුන්ද? *";
    r_text [61] = " * ඔබට පෙම්වතුන්/පෙම්වතියන් කී දෙනෙක් සිටියාද? *";
    r_text [62] = " * ඔබට දැන් පෙම්වතියක් සිටීද? *";
    r_text [63] = " * ඔබට දැන් ප්‍රියතමයක් තිබේද *";
    r_text [64] = " * ඔබ කැමති ඔබේ ශරීරයේ කුමන කොටසටද, ඔබ වෛර කරන කොටසටද? *";
    r_text [65] = " * ඔබ කැඩපත තුළ ඔබව අගය කරනවාද? *";
    r_text [66] = " * ඔබ අගය කරන කීර්තිමත් පුද්ගලයා කවුද? *";
    r_text [67] = " * ආදරය කරන කෙනෙකු ඉදිරියේ ඔබ පැවසූ හෝ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [68] = " * ඔබේ සිහින වල පුද්ගලයා විවාහ කර ගන්නා බව ඔබට පැවසුවහොත් දුරකථනයක් නොමැතිව ඔබ අවුරුද්දක් ගත කරනවාද *";
    r_text [69] = " * ඔබට ජීවිත කාලය පුරාම එක කොණ්ඩා මෝස්තරයක් පමණක් කළ හැකි නම්, ඔබ තෝරා ගන්නේ රැලි සහිත කෙස් හෝ කෙලින් කෙස් *";
    r_text [70] = " * ඔබට වඩා කෙටි කෙනෙකු සමඟ ඔබ පෙම් සබඳතාවක් පවත්වනවාද? *";
    r_text [71] = " * කැඩපත දෙස බලා සිටීම දිගු වේලාවක් ඔබව බිය ගන්වනවාද? *";
    r_text [72] = " * ඔබ ඔබේ සහකරු සමඟ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [73] = " * කාන්තාර දූපතක අතරමං වීමට ඔබ කැමති කවුද? *";
    r_text [74] = " * ඔබ කවදා හෝ බැහැර කර තිබේද? මෙයට හේතුව කුමක්ද *";
    r_text [75] = " * ඔබට හැකි නම් ඔබ විසින්ම වෙනස් කරන භෞතික දේපලක් යනු කුමක්ද? *";
    r_text [76] = " * ඔබේ ජීවිතයේ නිවැරදි දෙය? *";
    r_text [77] = " * ඔබට අද්භූත හැකියාවක් ලබා ගත හැකි නම්, එය කුමක් විය හැකිද? *";
    r_text [78] = " * ඔබ ඔවුන්ට ආදරය කරන කෙනෙකු පෙන්වන්නේ කෙසේද? *";
    r_text [79] = " * ඔබේ ළමා කාලය කෙසේද? *";
    r_text [80] = " * වචනයක් උත්පාදනය කර එහි තේරුම කියන්න *";
    r_text [81] = " * ඔබ හාස්කම් විශ්වාස කරනවාද? *";
    r_text [82] = " * ඔබව වඩාත්ම කලබලයට පත් කරන්නේ කුමක් ද? *";
    r_text [83] = " * ඔබේ ජීවිතයේ ඔබට අමතක නොවන කෙනෙකු සිටීද? *";
    r_text [84] = " * ඔබට පච්චයක් කොටා ගැනීමට අවශ්‍ය නම් ඔබ කුමක් කරන්නේද? *";
    r_text [85] = " * ඔබට කාල යන්ත්‍රයක් තිබුනේ නම් සහ ආපසු ගොස් ඔබ කළ එක් දෙයක් මකා දැමිය හැකි නම්, ඔබ කුමක් මකනවාද? *";
    r_text [86] = " *ඔවුන් ඔබව සහ ඔබේ ආදරවන්තියව වහල්භාවයට ගෙන ගියා නම් ඔබ තෝරා ගන්නේ කාවද?
    r_text [87] = " * ඔබට හැඩ වෙනස් කිරීමේ හැකියාවක් තිබුනේ නම්, ඔබ මුලින්ම කුමක් බවට පත් වන්නේද? *";
    r_text [88] = " * ඔබට කවදා හෝ පෙම්වතියක් සිටියාද? *";
    r_text [89] = " * ඔබ මිනිසුන්ගෙන් toත් වීමට කැමතිද? *";
    r_text [90] = " * රාත්‍රිය හෝ දවාල? *";
    r_text [91] = " * ඔබට මිනිසුන්ගේ සිතුවිලි කියවීමට හැකි නම්, ඔබ මුලින්ම කියවන්නේ කාගේද? *";
    r_text [92] = " * ඔබට විශේෂ කෙනෙක්ට ඔබ ලොකු බොරුවක් කිව්වාද? *";
    r_text [93] = " * ඔබට මෙම කණ්ඩායමේ කෙනෙකු සමඟ දිනාය හැකි නම් ඒ කවුද? *";
    r_text [94] = " * මෙම කණ්ඩායමේ ඔබට වැඩිපුර ආදරය කරන්නේ කවුරුන් යැයි ඔබ සිතනවාද? *";
    r_text [95] = " * ඔබ තනිව සිටින විට ඔබට මොන වගේ සිහින ද? *";
    r_text [96] = " * වැසි සහිත සරත් සෘතුවේ සන්ධ්‍යාවක් හෝ හිම සහිත ශීත සෘතු රාත්‍රියක්? *";
    r_text [97] = " * මෙම කණ්ඩායම තුළ ඔබට වඩාත් සමීපව දැනෙන්නේ කාටද? *";
    r_text [98] = " * මෙම කණ්ඩායමේ සැම දෙනාම අනතුරේ! ඔබට ඇත්තේ එක් අයෙකු බේරා ගැනීමට ඇත්තේ එක් අවස්ථාවක් පමණි. ඉතිරි අයට දිවි ගලවා ගැනීමේ 40% ක අවස්ථාවක් ඇත. ඔබ කාවද බේරා ගන්නේ? *";
    r_text [99] = " * ඔබට තම ආදරය පාපොච්චාරණය කළ කෙනෙකු ඔබ කවදා හෝ ප්‍රතික්ෂේප කර තිබේද? එසේ නම් ඔවුන්ගේ නම කුමක්ද? *";
    r_text [100] = " * තාත්තාද නැත්නම් යාලුවාද? *";
    r_text [101] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබ මීට පෙර කිසිවෙකු රවටා තිබේද *";
    r_text [102] = " * පාපොච්චාරණ කාලය! ඔබ ඔබේ පෞද්ගලික තොරතුරු වෙනත් කෙනෙකු සමඟ බෙදාගෙන තිබේද? *";
    r_text [103] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබ රාත්‍රියේදී රහසිගතව සිතන කෙනෙකු සිටීද? එසේ නම් ඔවුන්ගේ නම කුමක්ද? *";
    r_text [104] = " * පාපොච්චාරණය කිරීමට කාලයයි! මීට පෙර ඔබ කවදා හෝ ඔබේ හදවතේ ඔබේ ආදරය තැන්පත් කර තිබේද *";
   r_text [105] = " * පාපොච්චාරණය කිරීමට කාලයයි! මේ කණ්ඩායමේ සිටින්නේ ඔබට ආදරය කළ හැකි * *;
     r_text [106] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබේ හොඳම මිතුරා ඔබේ සිහින පෙම්වතා වෙනුවෙන් අත්හරිනවාද? *";
     r_text [107] = " * පාපොච්චාරණය කිරීමට කාලයයි! ශරීරය සහ ආකර්ෂණය අනුව මෙම කණ්ඩායමේ ඔබ කැමතිම පුද්ගලයා කවුද? *";
     r_text [108] = " * කොටු වී ඇත! ඉක්මනින් ප්‍රතිචාර දක්වන්න! ඔබේ පවුල අතහැර ඔබට වඩාත්ම කැමති පුද්ගලයා වෙත යන්න, නැත්නම් ඔබට වයස 40 ක් වන තුරු ඔබේ පවුලේ නිවසේ රැඳී සිටින්නද? *";
     r_text [109] = " * ඔබ කොටු වී ඇත! තුවක්කුවක් හිසට සහ හිසට හෝ ඔබේ ජීවිතයට හෝ ඔබේ පවුලේ අයගේ ජීවිතයට එල්ල කර ඇත. ඔබ තෝරා ගන්නේ කුමක් ද? *";
     r_text [110] = " * උගුලට හසු වී ඇත! ඔබට කැත, නමුත් පොහොසත් පුද්ගලයෙක් හෝ ලස්සන නමුත් දුප්පත් පුද්ගලයෙක් හමුවීමට අවශ්‍යද? *";
     r_text [111] = " * ජෝකර් ප්‍රශ්නය! මෙම ප්‍රශ්නය අසන්නට ඔබ ඉතා වාසනාවන්ත බව එයින් පෙන්නුම් කෙරේ. මෙන්න ඔබට මගේ ප්‍රශ්නය: \ n ආදරය හෝ මුදල් ද? *";

    var i = Math.floor(112*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'suro', fromMe: true, desc: SURO.none}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid, rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *මෙන්න කරදරය ..* 🤭 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
   r_text [0] = " * ඔබ ඔබගේ දුරකථනයෙන් අවසන් වරට සෙවුයේ කුමක්ද? *";
    r_text [1] = " * ඔබේ පෙම්වතිය / පෙම්වතා සමඟ වෙන්වීමට යමෙකු ඔබට ඩොලර් මිලියනයක් ලබා දුන්නේ නම්, ඔබ එය කරන්නෙහිද? *";
    r_text [2] = " * ඔබ කවදා හෝ යමක් ගෙන එය කෑවාද *";
    r_text [3] = " * ඔබට සර්පයන්, ගෙම්බන් වැනි දේ ආහාරයට ගැනීමට සිදු වූවාද? *";
    r_text [4] = " * ඔබ විරුද්ධ ලිංගයේ අයෙකු ලෙස එක් දිනක් අවදි වුවහොත් ඔබ කරන පළමු දෙය කුමක්ද *";
    r_text [5] = " * ඔබට මන anකල්පිත මිතුරෙකු වැඩෙමින් සිටියාද? *";
    r_text [6] = " * ඔබේ නරකම පුරුද්ද කුමක්ද? *";
    r_text [7] = " * ඔබට නාන කාමරයේ ගායනා කළ හැකිද? *";
    r_text [8] = " * සමාජය තුළ ඔබ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද? *";
    r_text [9] = " * ඔබ කවදා හෝ කැඩපත තුළ ඔබ සමඟම කතා කර තිබේද? *";
    r_text [10] = " * ඔබේ වෙබ් ඉතිහාසය යමෙකු දුටුවහොත් ඔබ ලැජ්ජා වන්නේ කුමක් ද? *";
    r_text [11] = " * ඔබ නින්දේදී කතා කරනවාද? *";
    r_text [12] = " * ඔබට පෞද්ගලිකව ලියූ කෙනෙකුට ඔබ අවසන් වරට යැවූ පණිවිඩය කුමක්ද? *";
    r_text [13] = " * ඔබ කියූ හෝ කළ දෙයක් මකා දැමීමට ඔබට අතීතයට යාමට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [14] = " * ඔබ නැවත ඉපදුණේ නම්, ඔබ කුමන සියවසේ ඉපදීමට කැමතිද? *";
    r_text [15] = " * ඔබ තවමත් කරන බොළඳ දේ කුමක්ද? *";
    r_text [16] = " * ඔබට නැවත නැවතත් නැරඹිය හැකි ළමා චිත්‍රපටය කුමක්ද? *";
    r_text [17] = " * ඔබට මෝඩ අන්වර්ථ නාම තිබේද? *";
    r_text [18] = " * ඔබ වැඩිපුරම කාලය වැය කරන්නේ ඔබේ දුරකථනයේ කුමන යෙදුමේද? *";
    r_text [19] = " * එකවර වාඩි වී වැඩිපුරම ආහාරයට ගත් ආහාරය කුමක්ද? *";
    r_text [20] = " * ඔබ තනිව නටනවාද? *";
    r_text [21] = " *ඔබ අඳුරට බියද? *";
    r_text [22] = " *ඔබ දවස මුළුල්ලේ ගෙදර සිටියා නම් ඔබ කුමක් කරන්නේද? *";
    r_text [23] = " *ඔබ දිනකට සෙල්ෆි කීයක් ගන්නවාද *";
    r_text [24] = " *ඔබ අවසන් වරට දත් මදින්නේ කවදාද? *";
    r_text [25] = " *ඔබේ ප්‍රියතම පිජාමා පෙනුම කෙබඳුද *";
    r_text [26] = " *නොකළ යුතු දෙයක් කරමින් ඔබ කිසි දිනෙක හසු වී තිබේද? එසේ නම් ඔබ කළේ කුමක්ද *";
    r_text [27] = " * ඔබ ඔබේ ශරීරයේ කුමන කොටසට කැමතිද, කුමන කොටසට වෛර කරනවාද? *";
    r_text [28] = " * ඔබට කවදා හෝ දෂ්ට කර තිබේද? *";
    r_text [29] = " * විලාසිතා සඳහා ඔබ කවදා හෝ ඔබේ කලිසම කපා දමා තිබේද? *";
    r_text [30] = " * ඔබ ඔබේ පිඟාන ලෙවකනවාද? *";
    r_text [31] = " * ඔබ ගැන කිසිවෙකු නොදන්නා යමක් තිබේද? *";
    r_text [32] = " * ඔබ මෙම කණ්ඩායමේ සියල්ලන්ම දැවෙන ගොඩනැගිල්ලකින් බේරා ගැනීමට උත්සාහ කළහොත් ඔබට යමෙකු හැර යාමට සිදු වූවා නම්, ඔබ හැර යන්නේ කවුරුන්ද? *";
    r_text [33] = " * ඔබ දුරකථනයෙන් අවසන් වරට සෙව්වේ කුමක්ද? *";
    r_text [34] = " * ඔබට සෝපානයේ ගෑස් නැති වී තිබේද? *";
    r_text [35] = " * ඔබ නාන කාමරයේ සිටියදී අහම්බෙන් කවුරුන් හෝ කඩා වැදුනේද? *";
    r_text [36] = " * ඔබ දිනකට විරුද්ධ ලිංගයේ අය නම් ඔබ මොකද කරන්නේ? *";
    r_text [37] = " * ඔබේ ජීවිතයේ එක් දෙයක් වෙනස් කිරීමට ඔබට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [38] = " * ඔබේ ලොකුම කනගාටුව කුමක්ද? *";
  r_text [39] = " * ඔබ කිසිවෙකුට සොයා ගත නොහැකි නරක දෙයක් කළාද? *";
    r_text [40] = " * ඔබගේ දුරකථනයේ ඇති අපහසුතාවයට පත් වූ ඡායාරූපය කුමක්ද? *";
    r_text [41] = " * ඔබ මෙතෙක් දැක ඇති බියකරු සිහිනය කුමක්ද? *";
    r_text [42] = " * මේස් මාරු කිරීමේදී ඔබේ දෙපා සුවඳ දැනෙනවාද? *";
    r_text [43] = " * සම්බන්ධතාවයකදී ඔබේ ලොකුම බිය කුමක්ද? *";
    r_text [44] = " * ඔබේ වයස ගැන ඔබ කවදා හෝ බොරු පවසා තිබේද? *";
    r_text [45] = " * ඔබේ විනෝදකාමී පළමු දිනය කුමක්ද? *";
    r_text [46] = " * ඔබේ අමුතුම පුරුද්ද කුමක්ද? *";
    r_text [47] = " * ඔබ දරුවන් කී දෙනෙක් ලැබීමට කැමතිද? *";
    r_text [48] = " * ඔබේ ළමා කාලයේ අන්වර්ථ නාමය කුමක්ද? *";
    r_text [49] = " * ඔබේ ප්‍රියතම ආහාරය කුමක්ද? *";
    r_text [50] = " * ඔබේ සිහින රැකියාව කුමක්ද? *";
    r_text [51] = " * ඔබ දින 3 ක් දූපතක සිරවී සිටී නම් ඔබ කුමක් කරන්නේද? *";
    r_text [52] = " * ඔබේ ප්‍රියතම පුද්ගලයා කවුද සහ ඇයි? *";
    r_text [53] = " * බැලූ බැල්මට ඔබ ආදරය විශ්වාස කරනවාද? *";
    r_text [54] = " * ඔබ ආදරය විශ්වාස කරනවාද? *";
    r_text [55] = " * ඔබට අවස්ථාවක් ලැබුනහොත් ඔබ ජීවත් වීමට කැමති කුමන රටේද? *";
    r_text [56] = " * ඔබේ සිහින මංගල උත්සවය කුමක්ද? *";
    r_text [57] = " * ඔබ දුටු අමුතුම සිහිනය විස්තර කළ හැකිද? *";
    r_text [58] = " * ඔබේ ලොකුම කනගාටුව කුමක්ද? *";
    r_text [59] = " * ඔබේ හිස සෝදා නොගෙන කොපමණ වේලාවක් බලා සිටියාද? *";
    r_text [60] = " * ඔබට කිසියම් ප්‍රසිද්ධ පුද්ගලයෙක් සමඟ විවාහ විය හැකි නම් ඒ කවුරුන්ද? *";
    r_text [61] = " * ඔබට පෙම්වතුන්/පෙම්වතියන් කී දෙනෙක් සිටියාද? *";
    r_text [62] = " * ඔබට දැන් පෙම්වතියක් සිටීද? *";
    r_text [63] = " * ඔබට දැන් ප්‍රියතමයක් තිබේද *";
    r_text [64] = " * ඔබ කැමති ඔබේ ශරීරයේ කුමන කොටසටද, ඔබ වෛර කරන කොටසටද? *";
    r_text [65] = " * ඔබ කැඩපත තුළ ඔබව අගය කරනවාද? *";
    r_text [66] = " * ඔබ අගය කරන කීර්තිමත් පුද්ගලයා කවුද? *";
    r_text [67] = " * ආදරය කරන කෙනෙකු ඉදිරියේ ඔබ පැවසූ හෝ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [68] = " * ඔබේ සිහින වල පුද්ගලයා විවාහ කර ගන්නා බව ඔබට පැවසුවහොත් දුරකථනයක් නොමැතිව ඔබ අවුරුද්දක් ගත කරනවාද *";
    r_text [69] = " * ඔබට ජීවිත කාලය පුරාම එක කොණ්ඩා මෝස්තරයක් පමණක් කළ හැකි නම්, ඔබ තෝරා ගන්නේ රැලි සහිත කෙස් හෝ කෙලින් කෙස් *";
    r_text [70] = " * ඔබට වඩා කෙටි කෙනෙකු සමඟ ඔබ පෙම් සබඳතාවක් පවත්වනවාද? *";
    r_text [71] = " * කැඩපත දෙස බලා සිටීම දිගු වේලාවක් ඔබව බිය ගන්වනවාද? *";
    r_text [72] = " * ඔබ ඔබේ සහකරු සමඟ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [73] = " * කාන්තාර දූපතක අතරමං වීමට ඔබ කැමති කවුද? *";
    r_text [74] = " * ඔබ කවදා හෝ බැහැර කර තිබේද? මෙයට හේතුව කුමක්ද *";
    r_text [75] = " * ඔබට හැකි නම් ඔබ විසින්ම වෙනස් කරන භෞතික දේපලක් යනු කුමක්ද? *";
    r_text [76] = " * ඔබේ ජීවිතයේ නිවැරදි දෙය? *";
    r_text [77] = " * ඔබට අද්භූත හැකියාවක් ලබා ගත හැකි නම්, එය කුමක් විය හැකිද? *";
    r_text [78] = " * ඔබ ඔවුන්ට ආදරය කරන කෙනෙකු පෙන්වන්නේ කෙසේද? *";
    r_text [79] = " * ඔබේ ළමා කාලය කෙසේද? *";
    r_text [80] = " * වචනයක් උත්පාදනය කර එහි තේරුම කියන්න *";
    r_text [81] = " * ඔබ හාස්කම් විශ්වාස කරනවාද? *";
    r_text [82] = " * ඔබව වඩාත්ම කලබලයට පත් කරන්නේ කුමක් ද? *";
    r_text [83] = " * ඔබේ ජීවිතයේ ඔබට අමතක නොවන කෙනෙකු සිටීද? *";
    r_text [84] = " * ඔබට පච්චයක් කොටා ගැනීමට අවශ්‍ය නම් ඔබ කුමක් කරන්නේද? *";
    r_text [85] = " * ඔබට කාල යන්ත්‍රයක් තිබුනේ නම් සහ ආපසු ගොස් ඔබ කළ එක් දෙයක් මකා දැමිය හැකි නම්, ඔබ කුමක් මකනවාද? *";
    r_text [86] = " *ඔවුන් ඔබව සහ ඔබේ ආදරවන්තියව වහල්භාවයට ගෙන ගියා නම් ඔබ තෝරා ගන්නේ කාවද?
    r_text [87] = " * ඔබට හැඩ වෙනස් කිරීමේ හැකියාවක් තිබුනේ නම්, ඔබ මුලින්ම කුමක් බවට පත් වන්නේද? *";
    r_text [88] = " * ඔබට කවදා හෝ පෙම්වතියක් සිටියාද? *";
    r_text [89] = " * ඔබ මිනිසුන්ගෙන් toත් වීමට කැමතිද? *";
    r_text [90] = " * රාත්‍රිය හෝ දවාල? *";
    r_text [91] = " * ඔබට මිනිසුන්ගේ සිතුවිලි කියවීමට හැකි නම්, ඔබ මුලින්ම කියවන්නේ කාගේද? *";
    r_text [92] = " * ඔබට විශේෂ කෙනෙක්ට ඔබ ලොකු බොරුවක් කිව්වාද? *";
    r_text [93] = " * ඔබට මෙම කණ්ඩායමේ කෙනෙකු සමඟ දිනාය හැකි නම් ඒ කවුද? *";
    r_text [94] = " * මෙම කණ්ඩායමේ ඔබට වැඩිපුර ආදරය කරන්නේ කවුරුන් යැයි ඔබ සිතනවාද? *";
    r_text [95] = " * ඔබ තනිව සිටින විට ඔබට මොන වගේ සිහින ද? *";
    r_text [96] = " * වැසි සහිත සරත් සෘතුවේ සන්ධ්‍යාවක් හෝ හිම සහිත ශීත සෘතු රාත්‍රියක්? *";
    r_text [97] = " * මෙම කණ්ඩායම තුළ ඔබට වඩාත් සමීපව දැනෙන්නේ කාටද? *";
    r_text [98] = " * මෙම කණ්ඩායමේ සැම දෙනාම අනතුරේ! ඔබට ඇත්තේ එක් අයෙකු බේරා ගැනීමට ඇත්තේ එක් අවස්ථාවක් පමණි. ඉතිරි අයට දිවි ගලවා ගැනීමේ 40% ක අවස්ථාවක් ඇත. ඔබ කාවද බේරා ගන්නේ? *";
    r_text [99] = " * ඔබට තම ආදරය පාපොච්චාරණය කළ කෙනෙකු ඔබ කවදා හෝ ප්‍රතික්ෂේප කර තිබේද? එසේ නම් ඔවුන්ගේ නම කුමක්ද? *";
    r_text [100] = " * තාත්තාද නැත්නම් යාලුවාද? *";
    r_text [101] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබ මීට පෙර කිසිවෙකු රවටා තිබේද *";
    r_text [102] = " * පාපොච්චාරණ කාලය! ඔබ ඔබේ පෞද්ගලික තොරතුරු වෙනත් කෙනෙකු සමඟ බෙදාගෙන තිබේද? *";
    r_text [103] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබ රාත්‍රියේදී රහසිගතව සිතන කෙනෙකු සිටීද? එසේ නම් ඔවුන්ගේ නම කුමක්ද? *";
    r_text [104] = " * පාපොච්චාරණය කිරීමට කාලයයි! මීට පෙර ඔබ කවදා හෝ ඔබේ හදවතේ ඔබේ ආදරය තැන්පත් කර තිබේද *";
    r_text [105] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබට ආදරය කළ හැකි මෙම කණ්ඩායමේ සිටින්නේ කවුද *";
    r_text [106] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබේ හොඳම මිතුරා ඔබේ සිහින පෙම්වතා වෙනුවෙන් අත්හරිනවාද? *";
    r_text [107] = " * පාපොච්චාරණය කිරීමට කාලයයි! ශරීරය සහ ආකර්ෂණය අනුව මෙම කණ්ඩායමේ ඔබ කැමතිම පුද්ගලයා කවුද? *";
    r_text [108] = " * ඔබ කොටු වී ඇත! ඉක්මනින් ප්‍රතිචාර දක්වන්න! ඔබේ පවුල හැර ගොස් ඔබට වඩාත්ම අවශ්‍ය පුද්ගලයා වෙත යාමට හෝ ඔබට 40 වන තෙක් ඔබේ පවුලේ නිවසේ සිටීමට? *";
    r_text [109] = " * ඔබ කොටු වී ඇත! තුවක්කුවක් හිසට සහ හිසට හෝ ඔබේ ජීවිතයට හෝ ඔබේ පවුලේ අයගේ ජීවිතයට එල්ල කර ඇත. ඔබ තෝරා ගන්නේ කුමක් ද? *";
    r_text [110] = " * උගුලට හසු වී ඇත! ඔබට කැත, නමුත් පොහොසත් පුද්ගලයෙක් හෝ ලස්සන නමුත් දුප්පත් පුද්ගලයෙක් හමුවීමට අවශ්‍යද? *";
    r_text [111] = " * ජෝකර් ප්‍රශ්නය! මෙම ප්‍රශ්නය අසන්නට ඔබ ඉතා වාසනාවන්ත බව එයින් පෙන්නුම් කෙරේ. මෙන්න ඔබට මගේ ප්‍රශ්නය: \ n ආදරය හෝ මුදල් ද? *";
    var i = Math.floor(112*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'challengesuro', fromMe: false, desc: SURO.challenge}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *මම ඔබට අමාරුම ප්‍රශ්න තෝරා ගනිමි ..* 😈 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
  r_text [0] = " * කෙනෙකු සමඟ දිනායනය කිරීමේදී ඔබ කළ වඩාත්ම අපහසුතාවයට පත් වූ දෙය කුමක්ද *";
    r_text [1] = " * පොදු ප්‍රවාහන සේවාවේදී ඔබ කළ වඩාත්ම විකාර සහගත දෙය කුමක්ද *";
    r_text [2] = " * ඔබ වෙනත් කෙනෙකුට පැවසූ කeරතම දෙය කුමක්ද? *";
    r_text [3] = " * එයින් ප්‍රතිවිපාක නැති බව ඔබ දැන සිටියා නම් ඔබ කුමක් කරන්නද? *";
    r_text [4] = " * ඔබ ඔබේ මිතුරන් සමඟ කිරීමට කැමති නමුත් ඔබේ පෙම්වතිය ඉදිරියේ කිසි දිනෙක නොකළ යුතු දේ කුමක්ද? *";
    r_text [5] = " * මේ ජීවිතයේ ඔබ වඩාත් ඊර්ෂ්‍යා කරන්නේ කවුද? *";
    r_text [6] = " * ආදරය සඳහා මම ඕනෑම දෙයක් කරන්නෙමි, නමුත්" එය "නොකරනවා යැයි ඔබ කියන්නේ කුමක්ද? *";
    r_text [7] = " * ඔබට විවිධ මිථ්‍යා විශ්වාස තිබේද? එසේ නම් ඒවා මොනවාද? *";
    r_text [8] = " * ඔබ එයට ආදරය කළ බව පිළිගැනීමට ඔබ ලැජ්ජා වන්නේ කුමන චිත්‍රපටය ද? *";
    r_text [9] = " * ඔබ අපහසුතාවයට පත් කරන ස්වයං රැකවරණ පුරුද්ද කුමක්ද? *";
    r_text [10] = " * කිසිවෙකු නොදන්නා බවට ඔබට සහතික වුවහොත් ඔබට කාව මරා දැමීමට අවශ්‍යද? *";
    r_text [11] = " * ඔබ වෙනකෙකු සඳහා මිලදී ගත් ලාභම තෑග්ග කුමක්ද? *";
    r_text [12] = " * ඔබ කවදා හෝ ප්‍රසිද්ධියේ නිරුවත් වී තිබේද? *";
    r_text [13] = " * ඔබ කවදා හෝ ප්‍රසිද්ධියේ ඔබේ නාසය ගන්නවාද? *";
    r_text [14] = " * ඔබ මහ රෑ කළ අපහසුතාවයට පත් වූ දෙය කුමක්ද? *";
    r_text [15] = " * නිරුවතින් සිටීම හෝ ඔබ සිතන සෑම දෙයක්ම ඔබේ කමිසයේ තිබීම? ඔබ තෝරා ගන්නේ කුමක් ද? *";
    r_text [16] = " * ඔබ කිසි විටෙකත් තටාකය තුළ මුත්‍රා කර කිසිවක් සිදු නොවූ ලෙස ක්‍රියා කර තිබේද? *";
    r_text [17] = " * මෙම කණ්ඩායමේ නරකම ඇඳුමින් සැරසී සිටින්නේ කවුදැයි ඔබ සිතන්නේද? *";
    r_text [18] = " * මෙම කාමරයේ සිටින මිනිසුන්ගෙන් ඔබ ඔබේ ජීවිතය වෙනස් කිරීමට කැමති ඇයි? ඇයි? *";
    r_text [19] = " * ඔබ වැසිකිළියේ හිඳගෙන සිටින විට ඔබට සිතෙන්නේ කුමක්ද? *";
    r_text [20] = " * ඔබ එය කරන විට ලැජ්ජාවට පත් වන ඔබේ අපහසුතාවයට පත් වන රසය කුමක්ද *";
    r_text [21] = " *ඔබට ඔබේ නාසය තෝරා ගත හැකිද? *";
    r_text [22] = " *ඔබ වඩාත් අපහසුතාවයට පත් වූ මොහොත *";
    r_text [23] = " *ඔබ කවදා හෝ පන්තියේදී හයියෙන් හted නඟා තිබේද *";
    r_text [24] = " *ඔබ කවදා හෝ ඔබ ගැන සරාගී ඡායාරූපයක් ගැනීමට උත්සාහ කර තිබේද? *";
    r_text [25] = " *ඔබේ රහසිගත ආශාව කවුද? *";
    r_text [26] = " *නොකළ යුතු දෙයක් කරමින් ඔබ කිසි දිනෙක හසු වී තිබේද? එසේ නම් ඔබ කළේ කුමක්ද *";
    r_text [27] = " * මෙම කාමරයේ උණුසුම්ම පුද්ගලයා කවුදැයි ඔබ සිතනවාද? *";
    r_text [28] = " * ඔබ ඔබේ වර්තමාන පෙම්වතිය හා විවාහ වනු ඇතැයි ඔබ සිතනවාද? *";
    r_text [29] = " * ඔබ ගැන කිසිවෙකු නොදන්නා කරුණ කුමක්ද? *";
    r_text [30] = " * ඔබට නොතිබිය යුතු චිත්‍රපටයක් ඔබ කවදා හෝ නැරඹුවාද? එසේ කළා නම් එහි නම කුමක්ද? *";
    r_text [31] = " * ඔබ කළ නීති විරෝධී දේ කුමක්ද? *";
    r_text [32] = " * ඔබේ සහෝදරයා තවත් සහෝදරයෙකුට ටීඑල් මිලියනයකට හුවමාරු කර ගන්නවාද? *";
    r_text [33] = " * ඔබට එක් පුද්ගලයෙකුට වඩා විවාහ වීමට හැකි නම්, ඔබ තෝරා ගන්නේ කාවද? *";
    r_text [34] = " * මෙම කණ්ඩායමේ නරකම පුද්ගලයා කවුරු විය හැකි යැයි ඔබ සිතනවාද? *";
    r_text [35] = " * ඔබේ පෙම්වතිය සමඟ වෙන්වීම සඳහා යමෙකු ඔබට ටීඑල් මිලියනයක් ලබා දුන්නේ නම් ඔබ යන්නවාද? *";
    r_text [36] = " * ඔබේ සහකරු ඔබව අපහසුතාවයට පත් කළාද? එසේ නම් එය කුමක්ද? *";
    r_text [37] = " * ඔබේ පෙම්වතියට වංචා කිරීමට ඔබ කවදා හෝ සිතුවාද *";
    r_text [38] = " * ඔබ කිසිවෙකු ඔත්තු බැලීමේදී හසු වී තිබේද? *";
    r_text [39] = " * ඔබ කිසි විටෙකත් ඔබේ නාසය තෝරාගෙන හසු වී තිබේද? *";
    r_text [40] = " * ඔබ කවදා හෝ පසුතැවෙන යමක් සමාජ මාධ්‍ය තුළ හුවමාරු කර ගත්තාද? එසේ නම් එය කුමක් ගැනද? *";
    r_text [41] = " * ඔබ ස්නානය කිරීමේදී මුත්‍රා කරනවාද? *";
    r_text [42] = " * මේස් මාරු කිරීමේදී ඔබේ දෙපා සුවඳ දැනෙනවාද? *";
   r_text [43] = " * ඔබේ ජීවිතයේ වඩාත්ම අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද? *";
    r_text [44] = " * ලෝකයේ ධනවත්ම පුද්ගලයා වීමට යමෙකු ඔබට යෝජනා කළත් ඔබ කිසි දිනෙක නොකරන එක් දෙයක් කුමක්ද? *";
    r_text [45] = " * මෙම කණ්ඩායමෙන් ඔබ කවුරුන්ද හමුවීමට කැමති? *";
    r_text [46] = " * මෙම කණ්ඩායමේ නරකම පෙම්වතිය කවුරු යැයි ඔබ සිතනවාද? *";
    r_text [47] = " * ඔබ කවදා හෝ ඔබේ පෙම්වතියගේ මිතුරා සමඟ ආදරයෙන් බැඳී තිබේද? *";
    r_text [48] = " * ඔබේ ජීවිතයේ ඔබ කළ නපුරු ක්‍රියාව කුමක්ද *";
    r_text [49] = " * ඔබ යමෙකුට කළ වඩාත්ම පිළිකුල් සහගත විහිළුව කුමක්ද? *";
    r_text [50] = " * ඔබේ පෙම්වතිය සමඟ ඔබට කිරීමට අවශ්‍ය වඩාත්ම විකාර සහගත දෙය කුමක්ද? *";
    r_text [51] = " * වෙනත් කෙනෙකුගේ බලපෑමට ලක් වූ ඔබ කළ වඩාත්ම විකාර සහගත දෙය කුමක්ද *";
    r_text [52] = " * නිරුවතින් සිටීම හෝ ඔබේ හිස මත සිතුවිලි ලිවීම යන දෙකෙන් එකක් තෝරා ගැනීමට ඔබට සිදු වුවහොත් ඔබ තෝරා ගන්නේ කුමක්ද? *";
    r_text [53] = " * ඔබ මීට පෙර ඔබේ සෙවල රස බැලුවාද? *";
    r_text [54] = " * වැසිකිළියේ වාඩි වී සිටියදී ඔබ සිතන්නේ මොනවාද?";
    r_text [55] = " * ඔබ කොටසක් වූ වඩාත්ම අපහසුතාවයට පත් වූ තත්ත්වය කුමක්ද? *";
    r_text [56] = " * ඔබේ වඩාත්ම අපහසුතාවයට පත් වන පුරුද්ද කුමක්ද? *";
    r_text [57] = " * ඔබ මීට පෙර කවදාවත් ඒ යටතේ මුත්‍රා කර තිබේද *";
    r_text [58] = " * ප්‍රසිද්ධියේ ඔබ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද *";
    r_text [59] = " * මිනිසුන්ට අහිතකර විය හැකි වුවත්, ඔබේ ප්‍රියතම දේ කුමක්ද? *";
    r_text [60] = " * ඔබ රහසිගතව උනන්දු වන්නේ කවුරුන්ද? *";
    r_text [61] = " * 1-10 පරිමාණයෙන් ඔබේ පෙනුම ඔබ තක්සේරු කරන්නේ කෙසේද? *";
    r_text [62] = " * ඔබ අහම්බෙන් මිතුරෙකුගේ රහසක් හෙළි කළාද? එසේ නම් එය කුමක්ද? *";
    r_text [63] = " * ඔබ ඔබේ වර්තමාන පෙම්වතිය/පෙම්වතා සමඟ විවාහ වනු ඇතැයි ඔබ සිතනවාද? *";
    r_text [64] = " * ඔබ කවදා හෝ කන් පෙත්තක් රස බැලුවාද? *";
    r_text [65] = " * ඔබ කවදා හෝ ඔබේ දහඩිය රස බැලුවාද? *";
    r_text [66] = " * ඔබ දන්නා නරකම පුද්ගලයා ඔබ යැයි විශ්වාස කරන මෙම කණ්ඩායමේ පුද්ගලයා කවුද? *";
    r_text [67] = " * ආදරය කරන කෙනෙකු ඉදිරියේ ඔබ පැවසූ හෝ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [68] = " * යථාර්ථවාදී නොවන ඔබේ ලොකුම බිය කුමක්ද? *";
    r_text [69] = " * ඔබේ තැලීම ඉදිරියේ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කවදා ද? *";
    r_text [70] = " * ඔබ අවසන් වරට ඔබේ ඇඳ තෙත් කළේ කවදාද? *";
    r_text [71] = " * කිසිවෙකු නොදන්නා ඔබේ ලොකුම රහස කුමක්ද? *";
    r_text [72] = " * ඔබව සරාගී කර ගැනීමට ඔබ කරන්නේ කුමක්ද? *";
    r_text [73] = " * ඔබව වැඩිපුරම යොමු කරන්නේ කුමක් ද? *";
    r_text [74] = " * ඔබට වෙනත් කෙනෙකුගේ පෙම්වතියක් සමඟ එළියට යාමට හැකි නම්, ඒ කවුරුන්ද? *";
    r_text [75] = " * ඔබ ආදරය කළ පුද්ගලයාට පණිවිඩයක් යැවීමට ඔබට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [76] = " * ඔබට මෙම කණ්ඩායමේ එක් අයෙකු හා විවාහ විය හැකි නම් ඒ කවුරුන්ද? *";

    var i = Math.floor(77*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'challengesuro', fromMe: true, desc: SURO.challenge}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *මම ඔබට අමාරුම ප්‍රශ්න තෝරා ගනිමි ..* 😈 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
   r_text [0] = " * කෙනෙකු සමඟ දිනායනය කිරීමේදී ඔබ කළ වඩාත්ම අපහසුතාවයට පත් වූ දෙය කුමක්ද *";
    r_text [1] = " * පොදු ප්‍රවාහන සේවාවේදී ඔබ කළ වඩාත්ම විකාර සහගත දෙය කුමක්ද *";
    r_text [2] = " * ඔබ වෙනත් කෙනෙකුට පැවසූ කeරතම දෙය කුමක්ද? *";
    r_text [3] = " * එයින් ප්‍රතිවිපාක නැති බව ඔබ දැන සිටියා නම් ඔබ කුමක් කරන්නද? *";
    r_text [4] = " * ඔබ ඔබේ මිතුරන් සමඟ කිරීමට කැමති නමුත් ඔබේ පෙම්වතිය ඉදිරියේ කිසි දිනෙක නොකළ යුතු දේ කුමක්ද? *";
    r_text [5] = " * මේ ජීවිතයේ ඔබ වඩාත් ඊර්ෂ්‍යා කරන්නේ කවුද? *";
    r_text [6] = " * ආදරය සඳහා මම ඕනෑම දෙයක් කරන්නෙමි, නමුත් එය නොකරනවා යැයි ඔබ කියන්නේ කුමක්ද? *";
    r_text [7] = " * ඔබට විවිධ මිථ්‍යා විශ්වාස තිබේද? එසේ නම් ඒවා මොනවාද? *";
    r_text [8] = " * ඔබ එයට ආදරය කළ බව පිළිගැනීමට ඔබ ලැජ්ජා වන්නේ කුමන චිත්‍රපටය ද? *";
    r_text [9] = " * ඔබ අපහසුතාවයට පත් කරන ස්වයං රැකවරණ පුරුද්ද කුමක්ද? *";
    r_text [10] = " * කිසිවෙකු නොදන්නා බවට ඔබට සහතික වුවහොත් ඔබට කාව මරා දැමීමට අවශ්‍යද? *";
    r_text [11] = " * ඔබ වෙනකෙකු සඳහා මිලදී ගත් ලාභම තෑග්ග කුමක්ද? *";
    r_text [12] = " * ඔබ කවදා හෝ ප්‍රසිද්ධියේ නිරුවත් වී තිබේද? *";
    r_text [13] = " * ඔබ කවදා හෝ ප්‍රසිද්ධියේ ඔබේ නාසය ගන්නවාද? *";
    r_text [14] = " * ඔබ මහ රෑ කළ අපහසුතාවයට පත් වූ දෙය කුමක්ද? *";
    r_text [15] = " * නිරුවතින් සිටීම හෝ ඔබ සිතන සෑම දෙයක්ම ඔබේ කමිසයේ තිබීම? ඔබ තෝරා ගන්නේ කුමක් ද? *";
    r_text [16] = " * ඔබ කිසි විටෙකත් තටාකය තුළ මුත්‍රා කර කිසිවක් සිදු නොවූ ලෙස ක්‍රියා කර තිබේද? *";
    r_text [17] = " * මෙම කණ්ඩායමේ නරකම ඇඳුමින් සැරසී සිටින්නේ කවුදැයි ඔබ සිතන්නේද? *";
    r_text [18] = " * මෙම කාමරයේ සිටින මිනිසුන්ගෙන් ඔබ ඔබේ ජීවිතය වෙනස් කිරීමට කැමති ඇයි? ඇයි? *";
    r_text [19] = " * ඔබ වැසිකිළියේ හිඳගෙන සිටින විට ඔබට සිතෙන්නේ කුමක්ද? *";
    r_text [20] = " * ඔබ එය කරන විට ලැජ්ජාවට පත් වන ඔබේ අපහසුතාවයට පත් වන රසය කුමක්ද *";
    r_text [21] = " *ඔබට ඔබේ නාසය තෝරා ගත හැකිද? *";
    r_text [22] = " *ඔබ වඩාත් අපහසුතාවයට පත් වූ මොහොත *";
    r_text [23] = " *ඔබ කවදා හෝ පන්තියේදී හයියෙන් හted නඟා තිබේද *";
    r_text [24] = " *ඔබ කවදා හෝ ඔබ ගැන සරාගී ඡායාරූපයක් ගැනීමට උත්සාහ කර තිබේද? *";
    r_text [25] = " *ඔබේ රහසිගත ආශාව කවුද? *";
    r_text [26] = " *නොකළ යුතු දෙයක් කරමින් ඔබ කිසි දිනෙක හසු වී තිබේද? එසේ නම් ඔබ කළේ කුමක්ද *";
    r_text [27] = " * මෙම කාමරයේ උණුසුම්ම පුද්ගලයා කවුදැයි ඔබ සිතනවාද? *";
    r_text [28] = " * ඔබ ඔබේ වර්තමාන පෙම්වතිය හා විවාහ වනු ඇතැයි ඔබ සිතනවාද? *";
    r_text [29] = " * ඔබ ගැන කිසිවෙකු නොදන්නා කරුණ කුමක්ද? *";
    r_text [30] = " * ඔබට නොතිබිය යුතු චිත්‍රපටයක් ඔබ කවදා හෝ නැරඹුවාද? එසේ කළා නම් එහි නම කුමක්ද? *";
    r_text [31] = " * ඔබ කළ නීති විරෝධී දේ කුමක්ද? *";
    r_text [32] = " * ඔබේ සහෝදරයා තවත් සහෝදරයෙකුට ටීඑල් මිලියනයකට හුවමාරු කර ගන්නවාද? *";
    r_text [33] = " * ඔබට එක් පුද්ගලයෙකුට වඩා විවාහ වීමට හැකි නම්, ඔබ තෝරා ගන්නේ කාවද? *";
    r_text [34] = " * මෙම කණ්ඩායමේ නරකම පුද්ගලයා කවුරු විය හැකි යැයි ඔබ සිතනවාද? *";
    r_text [35] = " * ඔබේ පෙම්වතිය සමඟ වෙන්වීම සඳහා යමෙකු ඔබට ටීඑල් මිලියනයක් ලබා දුන්නේ නම් ඔබ යන්නවාද? *";
    r_text [36] = " * ඔබේ සහකරු ඔබව අපහසුතාවයට පත් කළාද? එසේ නම් එය කුමක්ද? *";
    r_text [37] = " * ඔබේ පෙම්වතියට වංචා කිරීමට ඔබ කවදා හෝ සිතුවාද *";
    r_text [38] = " * ඔබ කිසිවෙකු ඔත්තු බැලීමේදී හසු වී තිබේද? *";
    r_text [39] = " * ඔබ කිසි විටෙකත් ඔබේ නාසය තෝරාගෙන හසු වී තිබේද? *";
    r_text [40] = " * ඔබ කවදා හෝ පසුතැවෙන යමක් සමාජ මාධ්‍ය තුළ හුවමාරු කර ගත්තාද? එසේ නම් එය කුමක් ගැනද? *";
    r_text [41] = " * ඔබ ස්නානය කිරීමේදී මුත්‍රා කරනවාද? *";
    r_text [42] = " * මේස් මාරු කිරීමේදී ඔබේ දෙපා සුවඳ දැනෙනවාද? *";
    r_text [43] = " * ඔබේ ජීවිතයේ වඩාත්ම අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද? *";
    r_text [44] = " * ලෝකයේ ධනවත්ම පුද්ගලයා වීමට යමෙකු ඔබට යෝජනා කළත් ඔබ කිසි දිනෙක නොකරන එක් දෙයක් කුමක්ද? *";
    r_text [45] = " * මෙම කණ්ඩායමෙන් ඔබ කවුරුන්ද හමුවීමට කැමති? *";
    r_text [46] = " * මෙම කණ්ඩායමේ නරකම පෙම්වතිය කවුරු යැයි ඔබ සිතනවාද? *";
    r_text [47] = " * ඔබ කවදා හෝ ඔබේ පෙම්වතියගේ මිතුරා සමඟ ආදරයෙන් බැඳී තිබේද? *";
   r_text [48] = " * ඔබේ ජීවිතයේ ඔබ කළ නපුරු ක්‍රියාව කුමක්ද *";
    r_text [49] = " * ඔබ යමෙකුට කළ වඩාත්ම පිළිකුල් සහගත විහිළුව කුමක්ද? *";
    r_text [50] = " * ඔබේ පෙම්වතිය සමඟ ඔබට කිරීමට අවශ්‍ය වඩාත්ම විකාර සහගත දෙය කුමක්ද? *";
    r_text [51] = " * වෙනත් කෙනෙකුගේ බලපෑමට ලක් වූ ඔබ කළ වඩාත්ම විකාර සහගත දෙය කුමක්ද *";
    r_text [52] = " * නිරුවතින් සිටීම හෝ ඔබේ හිස මත සිතුවිලි ලිවීම යන දෙකෙන් එකක් තෝරා ගැනීමට ඔබට සිදු වුවහොත් ඔබ තෝරා ගන්නේ කුමක්ද? *";
    r_text [53] = " * ඔබ මීට පෙර ඔබේ සෙවල රස බැලුවාද? *";
    r_text [54] = " * වැසිකිළියේ වාඩි වී සිටියදී ඔබ සිතන්නේ මොනවාද?";
    r_text [55] = " * ඔබ කොටසක් වූ වඩාත්ම අපහසුතාවයට පත් වූ තත්ත්වය කුමක්ද? *";
    r_text [56] = " * ඔබේ වඩාත්ම අපහසුතාවයට පත් වන පුරුද්ද කුමක්ද? *";
    r_text [57] = " * ඔබ මීට පෙර කවදාවත් ඒ යටතේ මුත්‍රා කර තිබේද *";
    r_text [58] = " * ප්‍රසිද්ධියේ ඔබ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද *";
    r_text [59] = " * මිනිසුන්ට අහිතකර විය හැකි වුවත්, ඔබේ ප්‍රියතම දේ කුමක්ද? *";
    r_text [60] = " * ඔබ රහසිගතව උනන්දු වන්නේ කවුරුන්ද? *";
    r_text [61] = " * 1-10 පරිමාණයෙන් ඔබේ පෙනුම ඔබ තක්සේරු කරන්නේ කෙසේද? *";
    r_text [62] = " * ඔබ අහම්බෙන් මිතුරෙකුගේ රහසක් හෙළි කළාද? එසේ නම් එය කුමක්ද? *";
    r_text [63] = " * ඔබ ඔබේ වර්තමාන පෙම්වතිය/පෙම්වතා සමඟ විවාහ වනු ඇතැයි ඔබ සිතනවාද? *";
    r_text [64] = " * ඔබ කවදා හෝ කන් පෙත්තක් රස බැලුවාද? *";
    r_text [65] = " * ඔබ කවදා හෝ ඔබේ දහඩිය රස බැලුවාද? *";
    r_text [66] = " * ඔබ දන්නා නරකම පුද්ගලයා ඔබ යැයි විශ්වාස කරන මෙම කණ්ඩායමේ පුද්ගලයා කවුද? *";
    r_text [67] = " * ආදරය කරන කෙනෙකු ඉදිරියේ ඔබ පැවසූ හෝ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [68] = " * යථාර්ථවාදී නොවන ඔබේ ලොකුම බිය කුමක්ද? *";
    r_text [69] = " * ඔබේ තැලීම ඉදිරියේ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කවදා ද? *";
    r_text [70] = " * ඔබ අවසන් වරට ඔබේ ඇඳ තෙත් කළේ කවදාද? *";
    r_text [71] = " * කිසිවෙකු නොදන්නා ඔබේ ලොකුම රහස කුමක්ද? *";
    r_text [72] = " * ඔබව සරාගී කර ගැනීමට ඔබ කරන්නේ කුමක්ද? *";
    r_text [73] = " * ඔබව වැඩිපුරම යොමු කරන්නේ කුමක් ද? *";
    r_text [74] = " * ඔබට වෙනත් කෙනෙකුගේ පෙම්වතියක් සමඟ එළියට යාමට හැකි නම්, ඒ කවුරුන්ද? *";
    r_text [75] = " * ඔබ ආදරය කළ පුද්ගලයාට පණිවිඩයක් යැවීමට ඔබට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [76] = " * ඔබට මෙම කණ්ඩායමේ එක් අයෙකු හා විවාහ විය හැකි නම් ඒ කවුරුන්ද? *";

    var i = Math.floor(77*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'sexsuro', fromMe: false, desc: SURO.sex}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' 💋 *ඔබ සූදානම්ද* 👅 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
   r_text [0] = " * ඔබට මෙම කණ්ඩායමේ විරුද්ධ ලිංගයේ අයෙකු සමඟ නිදා ගැනීමට හැකි නම්, ඒ කවුරුන්ද? *";
    r_text [1] = " * ඔබට විකල්ප දෙකක් ඇත, ඔබට වසර 1 ක් ලිංගික වහලෙකු වීමට හෝ ඔබේ ලිංගික අවයව වලට නරක ශල්‍යකර්මයක් කිරීමට අවශ්‍යද? *";
    r_text [2] = " * ඔබ නිරුවත් යැයි ඔබ සිතනවාද? *";
    r_text [3] = " * ඔබ කුමන කීර්තිමත් පුද්ගලයෙක් සමඟ ලිංගිකව හැසිරීමට කැමතිද? *";
    r_text [4] = " * ඔබ ලිංගිකව එක් වූ අසාමාන්‍ය ස්ථානය කොහෙද? *";
    r_text [5] = " * ඔබ අවසන් වරට ස්වයං වින්දනය කළේ කවදාද? *";
    r_text [6] = " * ඔබව ස්පර්ශ කිරීමේදී ඔබට හැඟෙන්නේ කෙසේද? *";
    r_text [7] = " * ඔබ වෙනත් යුවළක් ලිංගිකව හැසිරෙන අයුරු දැක තිබේද? *";
    r_text [8] = " * යමෙක් ඔබට පැවසූ සරාගී දේ මොනවාද? *";
    r_text [9] = " * ඔබ කවදා හෝ කැඩපත තුළින් ඔබේ ශරීරය දෙස බලා දවල් සිහින දැක තිබේද? *";
    r_text [10] = " * ඔබට කවදා හෝ එක් රාත්‍රී භෝජන සංග්‍රහයක් තිබේද *";
    r_text [11] = " * ඔබ නිරුවත් කළාද? *";
    r_text [12] = " * ඔබේ ගුරුවරයා ගැන ඔබ සිහින මැව්වාද? *";
    r_text [13] = " * ඔබ සතුටක් ලබා දීමට හෝ ලබා ගැනීමට කැමතිද? *";
    r_text [14] = " * ඔබ කිසි විටෙකත් නොකරන ලිංගික ක්‍රියාවක් යැයි කියන්න. *";
    r_text [15] = " * නව යොවුන් වියේදී ඔබ අල්ලා ගත් ඉතාම අසභ්‍ය දේ? *";
    r_text [16] = " * ඔබේ ජීවිතයේ ඔබට ලිංගික සහකරුවන් කී දෙනෙක් සිටියාද *";
    r_text [17] = " * ඔබට ඔබේ පළමු වින්දනය ලබා දුන්නේ කවුද? *";
    r_text [18] = " * ඔබ කවදා හෝ කෙනෙකුගේ කන්‍යාභාවය බිඳ දමා තිබේද? *";
    r_text [19] = " * ඔබ කැමති කාමුක දර්ශන වර්ගය කුමක්ද? *";
    r_text [20] = " * ඔබ කවදා හෝ පොදු වැසිකිලියක ස්වයං වින්දනයේ යෙදී තිබේද? *";
    r_text [21] = " * ඔබ කවදා හෝ ලිංගික සෙල්ලම් බඩුවක් භාවිතා කර තිබේද? *";
    r_text [22] = " * ඔබ කවදා හෝ ගුද ලිංගික සංසර්ගය සඳහා උත්සාහ කර තිබේද? *";
    r_text [23] = " * වෙනත් කෙනෙක් ඔබේ සිරුරට අත තැබුවොත් ඔබට ගින්නක් ඇති වෙනවාද? *";
    r_text [24] = " * යමෙකු තුළ ලිංගික ආකර්ෂණීය බවක් ඔබ දකින පළමු දෙය කුමක්ද? *";
    r_text [25] = " * ඔබ ස්වයං වින්දනය කළ අමුතුම තැන කොහේද? *";
    r_text [26] = " *ඔබේ ලිංගික මනාපය කුමක්ද? *";
    r_text [27] = " * ඔබේ ලිංගික ආශාව කෙතරම් ඉහළ ද? *";
    r_text [28] = " * ඔබ පහර දීමට කැමතිද? *";
    r_text [29] = " * ඔබව කුපිත කිරීමට ඇති විශ්වාසදායක ක්‍රමය කුමක්ද? *";
    r_text [30] = " * ඔබ අපිරිසිදු කතා වලට කැමතිද? *";
    r_text [31] = " * ඔබ කැමතිද ඉහළට හෝ පහළට වීමට? *";
    r_text [32] = " * ඔබ ලිංගික අවයවයක් ඇති කර ගැනීම සඳහා ඔබ යමෙකු සිප ගන්නේ කොතැනද? *";
    r_text [33] = " * විරුද්ධ ලිංගයේ අයගෙන් ඔබ ලිංගික සංසර්ගය ඇති කරන්නේ කෙසේද? *";
    r_text [34] = " * ඔබේ පළමු හාදුව විස්තර කරන්න. *";
    r_text [35] = " * ඔබ කී දෙනෙක් සමඟ ලිංගිකව හැසිරී තිබේද? *";
    r_text [36] = " * ඔබ කා සමඟද මුලින්ම ලිංගික සංසර්ගය කළේ? එය හොඳද? *";
    r_text [37] = " * ඔබ කවදා හෝ ලිංගිකව හැසිරීමට හසු වී තිබේද? *";
    r_text [38] = " * ඔබට ශිෂේණය හෝ යෝනි මාර්ගය තිබේ නම් ඔබ මුලින්ම කුමක් කරන්නේද";
    r_text [39] = " * ලිංගිකත්වය ගැන මෙතෙක් ඔබේ අදහස කුමක්ද? *";
    r_text [40] = " * ඔබේ ශරීරය ගැන ඔබ තෘප්තිමත්ද? *";
    r_text [41] = " * ඔබ පිරිමියෙක් නම් ඔබේ ලිංගේන්ද්‍රියේ ප්‍රමාණය සහ හැඩය විස්තර කරන්න. ඔබ එයින් තෘප්තිමත්ද? *";
    r_text [42] = " * ඔබ ඔබේම ශුක්‍රාණු රස බැලුවාද? ඔබ එයට කැමතිද? *";
    r_text [43] = " * ඔබේ වඩාත්ම අසාමාන්‍ය / තහනම් මන fකල්පිතයන් විස්තර කරන්න. *";
    r_text [44] = " * ඔබ සිහින මැවූ අමුතුම පුද්ගලයා කවුද? *";
    r_text [45] = " * ස්වයං වින්දනයේ යෙදෙන විට ඔබ නිතරම සිහින දකිනවාද? *";
    r_text [46] = " * ඔබේ අමුතුම පුරුද්ද කුමක්ද? *";
    r_text [47] = " * ඔබට ලැජ්ජාව පිළිබඳ අදහසක් තිබේද? එසේ නම් එය කුමක්ද? *";
    r_text [48] = " * ඔබ හිස් වන විට ඔබට හැඟෙන්නේ කෙසේද? *";
    r_text [49] = " * ඔබ ශුක්‍රාණු පිට කරන විට කෙදිනක හෝ හුස්ම හෙළනවාද? *";
    r_text [50] = " * ඔබේ ලිංගික අවයව ස්පර්ශ නොකර ඔබට ලිංගික සංසර්ගය කළ හැකිද? *";
    r_text [51] = " * ඔබේ තන පුඩු කෙතරම් සංවේදීද? ඔබ ඔබේ තන පුඩු සමඟ සෙල්ලම් කරනවාද? *";
    r_text [52] = " * ඔබට වෙනත් පුද්ගලයෙකු සමඟ හෝ ස්වයං වින්දනය තුළින් ලිංගික සංසර්ගය පහසු කර ගත හැකිද? *";
    r_text [53] = " * දෘඩ හෝ මෘදු සම්බන්ධතාවයකින් හිස් කිරීමට පහසු කුමක්ද? *";
    r_text [54] = " * ඔබ ඔබේ සහකරු සමඟ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [55] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n ඔබව හැරවන ඔබේ පෙම්වතියගේ සරාගී කොටස කුමක්ද?*";
    r_text [56] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි!*\ n ඔබට ඔබේ සමීපතම විරුද්ධ ලිංගයේ ඥාති සහෝදරයෙකු සමඟ ලිංගිකව හැසිරීමට අවශ්‍යද?*";
    r_text [57] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n මෙම කණ්ඩායමේ විරුද්ධ ලිංගයේ අයෙකු නිරුවතින් දැකීමට ඔබට අවස්ථාවක් තිබේ! ඔබ කාවද බලන්න කැමති?*";
    r_text [58] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n මැසොචිස්ටික් හා සරාගී පෙම්වතියක් සමඟ උණුසුම් රාත්‍රීන් හෝ ඔබට වඩා සාමාන්‍ය හා අඩු සරාගී පුද්ගලයෙකු සමඟ උණුසුම් රාත්‍රීන්?*";
    r_text [59] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි!*\ n ඔබට මෙම කණ්ඩායමේ කෙනෙකුගේ නිරුවත් ඡායාරූපයක් දැක ගත හැකි නමුත් මාස 1 ක් ස්වයං වින්දනයේ යෙදෙන්නේ නැත. කෙසේ හෝ එය දැකීමට ඔබ කැමතිද?*" ;
    r_text [60] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n පිරිමින් සඳහා; ඔබට එක් රාත්‍රී විවේකයක් සඳහා අයිතියක් ඇති අතර ඔබට තේරීම් දෙකක් තිබේ: ලානා රෝඩ්ස් හෝ බරබර පැල්වින් \ n ගැහැණු ළමයින් සඳහා; ජොනී සින්ස් හෝ ජෝර්ඩි?*" ;
    r_text [61] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුය!*\ n මෙම කණ්ඩායමේ ඔබ බලාපොරොත්තු සහිත සිහින කා සමඟද?*";
    r_text [62] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔවුන් ඔබට මනුෂ්‍යයෙකු තරම්ම යථාර්ථවාදී සුපිරි සරාගී රොබෝ යන්ත්‍රයක් ලබා දෙන නමුත් ඔබට මසකට වරක් පමණක් ලිංගිකව හැසිරීමට හෝ මධ්‍යම ආකර්ෂණීය පුද්ගලයෙකු සමඟ ලිංගිකව හැසිරීමට හැකි වේ ඔබට අවශ්‍යයි. ඔබ තෝරා ගන්නේ කුමක් ද? ";
     r_text [63] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔබේ සිහින හාදුව දර්ශනය සහ ඔබට එය කිරීමට අවශ්‍ය කවුරුන්ද යන්න විස්තර කරන්න.";
     r_text [64] = " *ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි! *\ n ඔබට අනපේක්ෂිත ලෙස ලිංගික සංසර්ගයක් ඇති වුනාද?";
     r_text [65] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔබට එකවර පුද්ගලයන් කිහිප දෙනෙකුට වඩා බලපෑම් කර තිබේද?";

    var i = Math.floor(66*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'sexsuro', fromMe: true, desc: SURO.sex}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' 💋 *ඔබ සූදානම්ද* 👅 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
    r_text [0] = " * ඔබට මෙම කණ්ඩායමේ විරුද්ධ ලිංගයේ අයෙකු සමඟ නිදා ගැනීමට හැකි නම්, ඒ කවුරුන්ද? *";
    r_text [1] = " * ඔබට විකල්ප දෙකක් ඇත, ඔබට වසර 1 ක් ලිංගික වහලෙකු වීමට හෝ ඔබේ ලිංගික අවයව වලට නරක ශල්‍යකර්මයක් කිරීමට අවශ්‍යද? *";
    r_text [2] = " * ඔබ නිරුවත් යැයි ඔබ සිතනවාද? *";
    r_text [3] = " * ඔබ කුමන කීර්තිමත් පුද්ගලයෙක් සමඟ ලිංගිකව හැසිරීමට කැමතිද? *";
    r_text [4] = " * ඔබ ලිංගිකව එක් වූ අසාමාන්‍ය ස්ථානය කොහෙද? *";
    r_text [5] = " * ඔබ අවසන් වරට ස්වයං වින්දනය කළේ කවදාද? *";
    r_text [6] = " * ඔබව ස්පර්ශ කිරීමේදී ඔබට හැඟෙන්නේ කෙසේද? *";
    r_text [7] = " * ඔබ වෙනත් යුවළක් ලිංගිකව හැසිරෙන අයුරු දැක තිබේද? *";
    r_text [8] = " * යමෙක් ඔබට පැවසූ සරාගී දේ මොනවාද? *";
    r_text [9] = " * ඔබ කවදා හෝ කැඩපත තුළින් ඔබේ ශරීරය දෙස බලා දවල් සිහින දැක තිබේද? *";
    r_text [10] = " * ඔබට කවදා හෝ එක් රාත්‍රී භෝජන සංග්‍රහයක් තිබේද *";
    r_text [11] = " * ඔබ නිරුවත් කළාද? *";
    r_text [12] = " * ඔබේ ගුරුවරයා ගැන ඔබ සිහින මැව්වාද? *";
    r_text [13] = " * ඔබ සතුටක් ලබා දීමට හෝ ලබා ගැනීමට කැමතිද? *";
    r_text [14] = " * ඔබ කිසි විටෙකත් නොකරන ලිංගික ක්‍රියාවක් යැයි කියන්න. *";
    r_text [15] = " * නව යොවුන් වියේදී ඔබ අල්ලා ගත් ඉතාම අසභ්‍ය දේ? *";
    r_text [16] = " * ඔබේ ජීවිතයේ ඔබට ලිංගික සහකරුවන් කී දෙනෙක් සිටියාද *";
    r_text [17] = " * ඔබට ඔබේ පළමු වින්දනය ලබා දුන්නේ කවුද? *";
    r_text [18] = " * ඔබ කවදා හෝ කෙනෙකුගේ කන්‍යාභාවය බිඳ දමා තිබේද? *";
    r_text [19] = " * ඔබ කැමති කාමුක දර්ශන වර්ගය කුමක්ද? *";
    r_text [20] = " * ඔබ කවදා හෝ පොදු වැසිකිලියක ස්වයං වින්දනයේ යෙදී තිබේද? *";
    r_text [21] = " * ඔබ කවදා හෝ ලිංගික සෙල්ලම් බඩුවක් භාවිතා කර තිබේද? *";
    r_text [22] = " * ඔබ කවදා හෝ ගුද ලිංගික සංසර්ගය සඳහා උත්සාහ කර තිබේද? *";
    r_text [23] = " * වෙනත් කෙනෙක් ඔබේ සිරුරට අත තැබුවොත් ඔබට ගින්නක් ඇති වෙනවාද? *";
    r_text [24] = " * යමෙකු තුළ ලිංගික ආකර්ෂණීය බවක් ඔබ දකින පළමු දෙය කුමක්ද? *";
    r_text [25] = " * ඔබ ස්වයං වින්දනය කළ අමුතුම තැන කොහේද? *";
    r_text [26] = " *ඔබේ ලිංගික මනාපය කුමක්ද? *";
    r_text [27] = " * ඔබේ ලිංගික ආශාව කෙතරම් ඉහළ ද? *";
    r_text [28] = " * ඔබ පහර දීමට කැමතිද? *";
    r_text [29] = " * ඔබව කුපිත කිරීමට ඇති විශ්වාසදායක ක්‍රමය කුමක්ද? *";
    r_text [30] = " * ඔබ අපිරිසිදු කතා වලට කැමතිද? *";
    r_text [31] = " * ඔබ කැමතිද ඉහළට හෝ පහළට වීමට? *";
    r_text [32] = " * ඔබ ලිංගික අවයවයක් ඇති කර ගැනීම සඳහා ඔබ යමෙකු සිප ගන්නේ කොතැනද? *";
    r_text [33] = " * විරුද්ධ ලිංගයේ අයගෙන් ඔබ ලිංගික සංසර්ගය ඇති කරන්නේ කෙසේද? *";
    r_text [34] = " * ඔබේ පළමු හාදුව විස්තර කරන්න. *";
    r_text [35] = " * ඔබ කී දෙනෙක් සමඟ ලිංගිකව හැසිරී තිබේද? *";
    r_text [36] = " * ඔබ කා සමඟද මුලින්ම ලිංගික සංසර්ගය කළේ? එය හොඳද? *";
    r_text [37] = " * ඔබ කවදා හෝ ලිංගිකව හැසිරීමට හසු වී තිබේද? *";
    r_text [38] = " * ඔබට ශිෂේණය හෝ යෝනි මාර්ගය තිබේ නම් ඔබ මුලින්ම කුමක් කරන්නේද";
    r_text [39] = " * ලිංගිකත්වය ගැන මෙතෙක් ඔබේ අදහස කුමක්ද? *";
    r_text [40] = " * ඔබේ ශරීරය ගැන ඔබ තෘප්තිමත්ද? *";
    r_text [41] = " * ඔබ පිරිමියෙක් නම් ඔබේ ලිංගේන්ද්‍රියේ ප්‍රමාණය සහ හැඩය විස්තර කරන්න. ඔබ එයින් තෘප්තිමත්ද? *";
    r_text [42] = " * ඔබ ඔබේම ශුක්‍රාණු රස බැලුවාද? ඔබ එයට කැමතිද? *";
    r_text [43] = " * ඔබේ වඩාත්ම අසාමාන්‍ය / තහනම් මන fකල්පිතයන් විස්තර කරන්න. *";
    r_text [44] = " * ඔබ සිහින මැවූ අමුතුම පුද්ගලයා කවුද? *";
    r_text [45] = " * ස්වයං වින්දනයේ යෙදෙන විට ඔබ නිතරම සිහින දකිනවාද? *";
    r_text [46] = " * ඔබේ අමුතුම පුරුද්ද කුමක්ද? *";
    r_text [47] = " * ඔබට ලැජ්ජාව පිළිබඳ අදහසක් තිබේද? එසේ නම් එය කුමක්ද? *";
    r_text [48] = " * ඔබ හිස් වන විට ඔබට හැඟෙන්නේ කෙසේද? *";
    r_text [49] = " * ඔබ ශුක්‍රාණු පිට කරන විට කෙදිනක හෝ හුස්ම හෙළනවාද? *";
    r_text [50] = " * ඔබේ ලිංගික අවයව ස්පර්ශ නොකර ඔබට ලිංගික සංසර්ගය කළ හැකිද? *";
    r_text [51] = " * ඔබේ තන පුඩු කෙතරම් සංවේදීද? ඔබ ඔබේ තන පුඩු සමඟ සෙල්ලම් කරනවාද? *";
    r_text [52] = " * ඔබට වෙනත් පුද්ගලයෙකු සමඟ හෝ ස්වයං වින්දනය තුළින් ලිංගික සංසර්ගය පහසු කර ගත හැකිද? *";
    r_text [53] = " * දෘඩ හෝ මෘදු සම්බන්ධතාවයකින් හිස් කිරීමට පහසු කුමක්ද? *";
    r_text [54] = " * ඔබ ඔබේ සහකරු සමඟ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [55] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n ඔබව හැරවන ඔබේ පෙම්වතියගේ සරාගී කොටස කුමක්ද?*";
    r_text [56] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි!*\ n ඔබට ඔබේ සමීපතම විරුද්ධ ලිංගයේ ඥාති සහෝදරයෙකු සමඟ ලිංගිකව හැසිරීමට අවශ්‍යද?*";
    r_text [57] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n මෙම කණ්ඩායමේ විරුද්ධ ලිංගයේ අයෙකු නිරුවතින් දැකීමට ඔබට අවස්ථාවක් තිබේ! ඔබ කාවද බලන්න කැමති?*";
    r_text [58] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n මැසොචිස්ටික් හා සරාගී පෙම්වතියක් සමඟ උණුසුම් රාත්‍රීන් හෝ ඔබට වඩා සාමාන්‍ය හා අඩු සරාගී පුද්ගලයෙකු සමඟ උණුසුම් රාත්‍රීන්?*";
    r_text [59] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි!*\ n ඔබට මෙම කණ්ඩායමේ කෙනෙකුගේ නිරුවත් ඡායාරූපයක් දැක ගත හැකි නමුත් මාස 1 ක් ස්වයං වින්දනයේ යෙදෙන්නේ නැත. කෙසේ හෝ එය දැකීමට ඔබ කැමතිද?*" ;
    r_text [60] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n පිරිමින් සඳහා; ඔබට එක් රාත්‍රී විවේකයක් සඳහා අයිතියක් ඇති අතර ඔබට තේරීම් දෙකක් තිබේ: ලානා රෝඩ්ස් හෝ බරබර පැල්වින් \ n ගැහැණු ළමයින් සඳහා; ජොනී සින්ස් හෝ ජෝර්ඩි?*" ;
    r_text [61] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුය!*\ n මෙම කණ්ඩායමේ ඔබ බලාපොරොත්තු සහිත සිහින කා සමඟද?*";
    r_text [62] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔවුන් ඔබට මිනිසෙකු තරම් යථාර්ථවාදී සුපිරි සරාගී රොබෝ යන්ත්‍රයක් ලබා දෙන නමුත් ඔබට මසකට වරක් පමණක් ලිංගිකව හැසිරීමට හෝ මධ්‍යම ආකර්ෂණීය පුද්ගලයෙකු සමඟ ලිංගිකව හැසිරීමට හැකි වේ ඔබට අවශ්‍යයි. ඔබ තෝරා ගන්නේ කුමක් ද? ";
    r_text [63] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔබේ සිහින හාදුව දර්ශනය සහ ඔබට එය කිරීමට අවශ්‍ය කවුරුන්ද යන්න විස්තර කරන්න.";
    r_text [64] = " *ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි! *\ n ඔබට අනපේක්ෂිත ලෙස ලිංගික සංසර්ගයක් ඇති වුනාද?";
    r_text [65] = " *ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි! *\ n ඔබට එකවර පුද්ගලයන් කිහිප දෙනෙකුට වඩා බලපෑම් කර තිබේද?";
    var i = Math.floor(66*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'lgbtsuro', fromMe: false, desc: SURO.lgbt}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *කරදර එනවා ..* 🏳️‍🌈 ', MessageType.text, { 
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}
        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
    r_text [0] = " * ඔබේ එකම ලිංගය ගැන +18 දේවල් ගැන ඔබ කවදාවත් සිතුවාද? *";
    r_text [1] = " * ඔබට ඔබේ සමලිංගිකයින් සමඟ පමණක් ලිංගිකව හැසිරීමට හැකි නම්, ඔබ මෙම කණ්ඩායම තුළ එය කරන්නේ කා සමඟද *";
    r_text [2] = " * ඔබ කරන දේවල් හෝ කතා කරන විදිහ නිසා ඔබ Trance යැයි ඔබ සැලකුවාද? *";
    r_text [3] = " * ඔබ මෙම කණ්ඩායමේ ඔබේ සමාන ලිංගය සමඟ සම්බන්ධතාවක් තිබුනේ නම්, ඔබ කා සමඟද? *";
    r_text [4] = " * ඔබ දේදුනු පාටට කැමතිද? *";
    r_text [5] = " * ඔබ LGBT අක්ෂර සමඟ ක්‍රීඩා කිරීමෙන් සතුටක් ලබනවාද? *";
    r_text [6] = " * ඔබට දින 1 ක් තවත් සමලිංගික පුද්ගලයෙක් බවට පරිවර්තනය වීමට හැකි නම් ඒ කවුරුන්ද? *";
    r_text [7] = " * ඔබේ මිතුරන් අතර ඔබට වඩා එල්ජීබීටී වීමට වැඩි ඉඩක් ඇත්තේ කවුද? *";
    r_text [8] = " * ඔබ ලෝකයේ ධනවත්ම පුද්ගලයා වන නමුත් සමලිංගික සහකරුවෙකු සිටී නම් හෝ දුප්පත් නමුත් විරුද්ධ ලිංගයේ සහකරුවෙකු සිටියත් ඔබ තෝරා ගන්නේ කුමක්ද? *";
    r_text [9] = " * ඔබේ සමලිංගික පුරුෂ භාවය තුළ ඔබ ගත කරන එක් රැයක් සඳහා ඩොලර් මිලියනයක මුදලක් ඔබට ලැබෙනු ඇත. නමුත් මෙම මුදල් පවතින්නේ දින 3 ක් පමණි. එය නැවත ලබා ගැනීම සඳහා ඔබ නැවත ලිංගිකව එකතු වේද? *";
    r_text [10] = " * ඔබ මෙම ශරීරයට අයත් නොවන බව ඔබට කවදා හෝ දැනී තිබේද? *";
    r_text [11] = " * ඔබ ඔබේ ආදරය පාපොච්චාරණය කරන්නේ නම්, ඔබ එය කවරෙකුට කියන්නේද? *";
    r_text [12] = " * දේදුනු වර්ණ ඇඳුමක් ඇඳීමට ඔබ බියද? *";
    r_text [13] = " * සාමාන්‍ය හෝ සමලිංගික සබඳතා වඩාත් ප්‍රියජනක යැයි ඔබ සිතනවාද? *";
    r_text [14] = " * LGBT පුද්ගලයින් ගැන ඔබේ අදහස කුමක්ද? *";
    r_text [15] = " * ඔබ සමාජ මාධ්‍ය ඔස්සේ LGBT පුද්ගලයින් අනුගමනය කරනවාද? *";
    r_text [16] = " * ඔබට එකම සමලිංගික පුරුෂයෙකුට පමණක් දින යා හැකි නම් ඒ කවුරුන්ද *";
    r_text [17] = " * ඔබ ගැහැණු ළමයෙක්/පිරිමි ළමයෙක් වේ යැයි ඔබ කවදා හෝ කැමති වූවාද? *";
    r_text [18] = " * ඔබ විරුද්ධ ලිංගයේ ඇඳුම් ඇඳීමට කැමතිද? එය ඔබට ගැලපේ යැයි ඔබ සිතනවාද? *";
    r_text [19] = " * පීඩනයක් සහ 100% ස්ත්‍රී පුරුෂ භාවය නැවත පැවරීමේ සැත්කමක් නොමැති නම් ඔබ එය කරන්නද? *";
    r_text [20] = " * ඔබේ සහකරු ඔබ ඇඳගෙන යන ඇඳුම් මොනවාද? *";
    r_text [21] = " * වසර ගණනාවක සිට ඔබේ හොඳම මිතුරා සහ ඔබ සමඟ සිටින කෙනෙකු ඔබ ගැන උනන්දුවක් දැක්වීමට පටන් ගෙන ඇත. ඔබ ඔහුව ඔබේ ජීවිතයෙන් ඉවත් කර ගන්නවාද *";
    r_text [22] = " * ඔබේ සෙසු මිනිසා ඔබට ඔහුගේ ආදරය පාපොච්චාරණය කළහොත් ඔබේ පළමු ප්‍රතිචාරය සහ ඔබේ ඊළඟ ප්‍රතික්‍රියාව කුමක්ද *";
    r_text [23] = " * ඔබ ලීරා 200 ක් සඳහා දින 1 ක් එල්ජීබීටී ධජයක් සහිත හිස් ආවරණයක් පළඳින්නේද? *";
    r_text [24] = " * ඔබ ඔබේ සමලිංගික සේවනයම ටීඑල් 1000 කට තොල් මත සිපගන්නවාද? එපමණක් නොව, ඔබ මෙය කරන සෑම අවස්ථාවකම ඔබට ටීඑල් 1000 ක් ලැබේ. ඔබ එය තවත් කරනවාද? *";
    r_text [25] = " * ඔබේ හොඳම මිතුරා ඔබව හැරවීමට උත්සාහ කරයි. ඔබ මෙය සිදු වීමට ඉඩ දෙනවාද? *";
    r_text [26] = " * ඔබ ඔබේ සෙසු මිනිසා සමඟ දැඩි උණුසුම් වාතාවරණයක් නිර්මාණය කර ඇත. ඔබට පාලනය අහිමි වෙමින් පවතී .. ඔබ එය භුක්ති විඳ එයට ගලා යාමට සලස්වනවාද නැත්නම් ඔබ නවත්වන්න යැයි කීවොත් *";
    r_text [27] = " * විරුද්ධ ලිංගයේ අය ඔබට ඔබේ සමලිංගික සේවනයට වඩා බොහෝ සෙයින් ආදරය හා සෙනෙහස ලබා දෙයි. ඔබ දෙදෙනාටම අවස්ථාවක් ඇතැයි ඔබ සිතනවාද? *";

    var i = Math.floor(27*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
         MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'lgbtsuro', fromMe: true, desc: SURO.lgbt}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *කරදර එනවා ..* 🏳️‍🌈 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}
        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
   r_text [0] = " * ඔබේ එකම ලිංගය ගැන +18 දේවල් ගැන ඔබ කවදාවත් සිතුවාද? *";
    r_text [1] = " * ඔබට ඔබේ සමලිංගිකයින් සමඟ පමණක් ලිංගිකව හැසිරීමට හැකි නම්, ඔබ මෙම කණ්ඩායම තුළ එය කරන්නේ කා සමඟද *";
    r_text [2] = " * ඔබ කරන දේවල් හෝ කතා කරන විදිහ නිසා ඔබ Trance යැයි ඔබ සැලකුවාද? *";
    r_text [3] = " * ඔබ මෙම කණ්ඩායමේ ඔබේ සමාන ලිංගය සමඟ සම්බන්ධතාවක් තිබුනේ නම්, ඔබ කා සමඟද? *";
    r_text [4] = " * ඔබ දේදුනු පාටට කැමතිද? *";
    r_text [5] = " * ඔබ LGBT අක්ෂර සමඟ ක්‍රීඩා කිරීමෙන් සතුටක් ලබනවාද? *";
    r_text [6] = " * ඔබට දින 1 ක් තවත් සමලිංගික පුද්ගලයෙක් බවට පරිවර්තනය වීමට හැකි නම් ඒ කවුරුන්ද? *";
    r_text [7] = " * ඔබේ මිතුරන් අතර ඔබට වඩා එල්ජීබීටී වීමට වැඩි ඉඩක් ඇත්තේ කවුද? *";
    r_text [8] = " * ඔබ ලෝකයේ ධනවත්ම පුද්ගලයා වන නමුත් සමලිංගික සහකරුවෙකු සිටී නම් හෝ දුප්පත් නමුත් විරුද්ධ ලිංගයේ සහකරුවෙකු සිටියත් ඔබ තෝරා ගන්නේ කුමක්ද? *";
    r_text [9] = " * ඔබේ සමලිංගික පුරුෂ භාවය තුළ ඔබ ගත කරන එක් රැයක් සඳහා ඩොලර් මිලියනයක මුදලක් ඔබට ලැබෙනු ඇත. නමුත් මෙම මුදල් පවතින්නේ දින 3 ක් පමණි. එය නැවත ලබා ගැනීම සඳහා ඔබ නැවත ලිංගිකව එකතු වේද? *";
    r_text [10] = " * ඔබ මෙම ශරීරයට අයත් නොවන බව ඔබට කවදා හෝ දැනී තිබේද? *";
    r_text [11] = " * ඔබ ඔබේ ආදරය පාපොච්චාරණය කරන්නේ නම්, ඔබ එය කවරෙකුට කියන්නේද? *";
    r_text [12] = " * දේදුනු වර්ණ ඇඳුමක් ඇඳීමට ඔබ බියද? *";
    r_text [13] = " * සාමාන්‍ය හෝ සමලිංගික සබඳතා වඩාත් ප්‍රියජනක යැයි ඔබ සිතනවාද? *";
    r_text [14] = " * LGBT පුද්ගලයින් ගැන ඔබේ අදහස කුමක්ද? *";
    r_text [15] = " * ඔබ සමාජ මාධ්‍ය ඔස්සේ LGBT පුද්ගලයින් අනුගමනය කරනවාද? *";
    r_text [16] = " * ඔබට එකම සමලිංගික පුරුෂයෙකුට පමණක් දින යා හැකි නම් ඒ කවුරුන්ද *";
    r_text [17] = " * ඔබ ගැහැණු ළමයෙක්/පිරිමි ළමයෙක් වේ යැයි ඔබ කවදා හෝ කැමති වූවාද? *";
    r_text [18] = " * ඔබ විරුද්ධ ලිංගයේ ඇඳුම් ඇඳීමට කැමතිද? එය ඔබට ගැලපේ යැයි ඔබ සිතනවාද? *";
    r_text [19] = " * පීඩනයක් සහ 100% ස්ත්‍රී පුරුෂ භාවය නැවත පැවරීමේ සැත්කමක් නොමැති නම් ඔබ එය කරන්නද? *";
    r_text [20] = " * ඔබේ සහකරු ඔබ ඇඳගෙන යන ඇඳුම් මොනවාද? *";
    r_text [21] = " * වසර ගණනාවක සිට ඔබේ හොඳම මිතුරා සහ ඔබ සමඟ සිටින කෙනෙකු ඔබ ගැන උනන්දුවක් දැක්වීමට පටන් ගෙන ඇත. ඔබ ඔහුව ඔබේ ජීවිතයෙන් ඉවත් කර ගන්නවාද *";
    r_text [22] = " * ඔබේ සෙසු මිනිසා ඔබට ඔහුගේ ආදරය පාපොච්චාරණය කළහොත් ඔබේ පළමු ප්‍රතිචාරය සහ ඔබේ ඊළඟ ප්‍රතික්‍රියාව කුමක්ද *";
    r_text [23] = " * ඔබ ලීරා 200 ක් සඳහා දින 1 ක් එල්ජීබීටී ධජයක් සහිත හිස් ආවරණයක් පළඳින්නේද? *";
    r_text [24] = " * ඔබ ඔබේ සමලිංගික සේවනයම ටීඑල් 1000 කට තොල් මත සිපගන්නවාද? එපමණක් නොව, ඔබ මෙය කරන සෑම අවස්ථාවකම ඔබට ටීඑල් 1000 ක් ලැබේ. ඔබ එය තවත් කරනවාද? *";
    r_text [25] = " * ඔබේ හොඳම මිතුරා ඔබව හැරවීමට උත්සාහ කරයි. ඔබ මෙය සිදු වීමට ඉඩ දෙනවාද? *";
    r_text [26] = " * ඔබ ඔබේ සෙසු මිනිසා සමඟ දැඩි උණුසුම් වාතාවරණයක් නිර්මාණය කර ඇත. ඔබට පාලනය අහිමි වෙමින් පවතී .. ඔබ එය භුක්ති විඳ එයට ගලා යාමට සලස්වනවාද නැත්නම් ඔබ නවත්වන්න යැයි කීවොත් *";
    r_text [27] = " * විරුද්ධ ලිංගයේ අය ඔබට ඔබේ සමලිංගික සේවනයට වඩා බොහෝ සෙයින් ආදරය හා සෙනෙහස ලබා දෙයි. ඔබ දෙදෙනාටම අවස්ථාවක් ඇතැයි ඔබ සිතනවාද? *";

    var i = Math.floor(27*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
         MessageType.text
    );

    }));
}
else if (cof.WORKTYPE == 'private') {
    Asena.addCommand({pattern: 'suro', fromMe: true, desc: SURO.none}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid, rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *මෙන්න ගැටලුව පැමිණේ ..* 🤭 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
   r_text [0] = " * ඔබ ඔබගේ දුරකථනයෙන් අවසන් වරට සෙවුයේ කුමක්ද? *";
    r_text [1] = " * ඔබේ පෙම්වතිය / පෙම්වතා සමඟ වෙන්වීමට යමෙකු ඔබට ඩොලර් මිලියනයක් ලබා දුන්නේ නම්, ඔබ එය කරන්නෙහිද? *";
    r_text [2] = " * ඔබ කවදා හෝ යමක් ගෙන එය කෑවාද *";
    r_text [3] = " * ඔබට සර්පයන්, ගෙම්බන් වැනි දේ ආහාරයට ගැනීමට සිදු වූවාද? *";
    r_text [4] = " * ඔබ විරුද්ධ ලිංගයේ අයෙකු ලෙස එක් දිනක් අවදි වුවහොත් ඔබ කරන පළමු දෙය කුමක්ද *";
    r_text [5] = " * ඔබට මන anකල්පිත මිතුරෙකු වැඩෙමින් සිටියාද? *";
    r_text [6] = " * ඔබේ නරකම පුරුද්ද කුමක්ද? *";
    r_text [7] = " * ඔබට නාන කාමරයේ ගායනා කළ හැකිද? *";
    r_text [8] = " * සමාජය තුළ ඔබ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද? *";
    r_text [9] = " * ඔබ කවදා හෝ කැඩපත තුළ ඔබ සමඟම කතා කර තිබේද? *";
    r_text [10] = " * ඔබේ වෙබ් ඉතිහාසය යමෙකු දුටුවහොත් ඔබ ලැජ්ජා වන්නේ කුමක් ද? *";
    r_text [11] = " * ඔබ නින්දේදී කතා කරනවාද? *";
    r_text [12] = " * ඔබට පෞද්ගලිකව ලියූ කෙනෙකුට ඔබ අවසන් වරට යැවූ පණිවිඩය කුමක්ද? *";
    r_text [13] = " * ඔබ කියූ හෝ කළ දෙයක් මකා දැමීමට ඔබට අතීතයට යාමට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [14] = " * ඔබ නැවත ඉපදුණේ නම්, ඔබ කුමන සියවසේ ඉපදීමට කැමතිද? *";
    r_text [15] = " * ඔබ තවමත් කරන බොළඳ දේ කුමක්ද? *";
    r_text [16] = " * ඔබට නැවත නැවතත් නැරඹිය හැකි ළමා චිත්‍රපටය කුමක්ද? *";
    r_text [17] = " * ඔබට මෝඩ අන්වර්ථ නාම තිබේද? *";
    r_text [18] = " * ඔබ වැඩිපුරම කාලය වැය කරන්නේ ඔබේ දුරකථනයේ කුමන යෙදුමේද? *";
    r_text [19] = " * එකවර වාඩි වී වැඩිපුරම ආහාරයට ගත් ආහාරය කුමක්ද? *";
    r_text [20] = " * ඔබ තනිව නටනවාද? *";
    r_text [21] = " *ඔබ අඳුරට බියද? *";
    r_text [22] = " *ඔබ දවස මුළුල්ලේ ගෙදර සිටියා නම් ඔබ කුමක් කරන්නේද? *";
    r_text [23] = " *ඔබ දිනකට සෙල්ෆි කීයක් ගන්නවාද *";
    r_text [24] = " *ඔබ අවසන් වරට දත් මදින්නේ කවදාද? *";
    r_text [25] = " *ඔබේ ප්‍රියතම පිජාමා පෙනුම කෙබඳුද *";
    r_text [26] = " *නොකළ යුතු දෙයක් කරමින් ඔබ කිසි දිනෙක හසු වී තිබේද? එසේ නම් ඔබ කළේ කුමක්ද *";
    r_text [27] = " * ඔබ ඔබේ ශරීරයේ කුමන කොටසට කැමතිද, කුමන කොටසට වෛර කරනවාද? *";
    r_text [28] = " * ඔබට කවදා හෝ දෂ්ට කර තිබේද? *";
    r_text [29] = " * විලාසිතා සඳහා ඔබ කවදා හෝ ඔබේ කලිසම කපා දමා තිබේද? *";
    r_text [30] = " * ඔබ ඔබේ පිඟාන ලෙවකනවාද? *";
    r_text [31] = " * ඔබ ගැන කිසිවෙකු නොදන්නා යමක් තිබේද? *";
    r_text [32] = " * ඔබ මෙම කණ්ඩායමේ සියල්ලන්ම දැවෙන ගොඩනැගිල්ලකින් බේරා ගැනීමට උත්සාහ කළහොත් ඔබට යමෙකු හැර යාමට සිදු වූවා නම්, ඔබ හැර යන්නේ කවුරුන්ද? *";
    r_text [33] = " * ඔබ දුරකථනයෙන් අවසන් වරට සෙව්වේ කුමක්ද? *";
    r_text [34] = " * ඔබට සෝපානයේ ගෑස් නැති වී තිබේද? *";
    r_text [35] = " * ඔබ නාන කාමරයේ සිටියදී අහම්බෙන් කවුරුන් හෝ කඩා වැදුනේද? *";
    r_text [36] = " * ඔබ දිනකට විරුද්ධ ලිංගයේ අය නම් ඔබ මොකද කරන්නේ? *";
    r_text [37] = " * ඔබේ ජීවිතයේ එක් දෙයක් වෙනස් කිරීමට ඔබට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [38] = " * ඔබේ ලොකුම කනගාටුව කුමක්ද? *";
    r_text [39] = " * ඔබ කිසිවෙකුට සොයා ගත නොහැකි නරක දෙයක් කළාද? *";
    r_text [40] = " * ඔබගේ දුරකථනයේ ඇති අපහසුතාවයට පත් වූ ඡායාරූපය කුමක්ද? *";
    r_text [41] = " * ඔබ මෙතෙක් දැක ඇති බියකරු සිහිනය කුමක්ද? *";
    r_text [42] = " * මේස් මාරු කිරීමේදී ඔබේ දෙපා සුවඳ දැනෙනවාද? *";
    r_text [43] = " * සම්බන්ධතාවයකදී ඔබේ ලොකුම බිය කුමක්ද? *";
    r_text [44] = " * ඔබේ වයස ගැන ඔබ කවදා හෝ බොරු පවසා තිබේද? *";
    r_text [45] = " * ඔබේ විනෝදකාමී පළමු දිනය කුමක්ද? *";
    r_text [46] = " * ඔබේ අමුතුම පුරුද්ද කුමක්ද? *";
    r_text [47] = " * ඔබ දරුවන් කී දෙනෙක් ලැබීමට කැමතිද? *";
    r_text [48] = " * ඔබේ ළමා කාලයේ අන්වර්ථ නාමය කුමක්ද? *";
    r_text [49] = " * ඔබේ ප්‍රියතම ආහාරය කුමක්ද? *";
    r_text [50] = " * ඔබේ සිහින රැකියාව කුමක්ද? *";
    r_text [51] = " * ඔබ දින 3 ක් දූපතක සිරවී සිටී නම් ඔබ කුමක් කරන්නේද? *";
    r_text [52] = " * ඔබේ ප්‍රියතම පුද්ගලයා කවුද සහ ඇයි? *";
    r_text [53] = " * බැලූ බැල්මට ඔබ ආදරය විශ්වාස කරනවාද? *";
    r_text [54] = " * ඔබ ආදරය විශ්වාස කරනවාද? *";
    r_text [55] = " * ඔබට අවස්ථාවක් ලැබුනහොත් ඔබ ජීවත් වීමට කැමති කුමන රටේද? *";
    r_text [56] = " * ඔබේ සිහින මංගල උත්සවය කුමක්ද? *";
    r_text [57] = " * ඔබ දුටු අමුතුම සිහිනය විස්තර කළ හැකිද? *";
    r_text [58] = " * ඔබේ ලොකුම කනගාටුව කුමක්ද? *";
    r_text [59] = " * ඔබේ හිස සෝදා නොගෙන කොපමණ වේලාවක් බලා සිටියාද? *";
    r_text [60] = " * ඔබට කිසියම් ප්‍රසිද්ධ පුද්ගලයෙක් සමඟ විවාහ විය හැකි නම් ඒ කවුරුන්ද? *";
    r_text [61] = " * ඔබට පෙම්වතුන්/පෙම්වතියන් කී දෙනෙක් සිටියාද? *";
    r_text [62] = " * ඔබට දැන් පෙම්වතියක් සිටීද? *";
    r_text [63] = " * ඔබට දැන් ප්‍රියතමයක් තිබේද *";
    r_text [64] = " * ඔබ කැමති ඔබේ ශරීරයේ කුමන කොටසටද, ඔබ වෛර කරන කොටසටද? *";
    r_text [65] = " * ඔබ කැඩපත තුළ ඔබව අගය කරනවාද? *";
    r_text [66] = " * ඔබ අගය කරන කීර්තිමත් පුද්ගලයා කවුද? *";
    r_text [67] = " * ආදරය කරන කෙනෙකු ඉදිරියේ ඔබ පැවසූ හෝ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [68] = " * ඔබේ සිහින වල පුද්ගලයා විවාහ කර ගන්නා බව ඔබට පැවසුවහොත් දුරකථනයක් නොමැතිව ඔබ අවුරුද්දක් ගත කරනවාද *";
    r_text [69] = " * ඔබට ජීවිත කාලය පුරාම එක කොණ්ඩා මෝස්තරයක් පමණක් කළ හැකි නම්, ඔබ තෝරා ගන්නේ රැලි සහිත කෙස් හෝ කෙලින් කෙස් *";
    r_text [70] = " * ඔබට වඩා කෙටි කෙනෙකු සමඟ ඔබ පෙම් සබඳතාවක් පවත්වනවාද? *";
    r_text [71] = " * කැඩපත දෙස බලා සිටීම දිගු වේලාවක් ඔබව බිය ගන්වනවාද? *";
    r_text [72] = " * ඔබ ඔබේ සහකරු සමඟ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [73] = " * කාන්තාර දූපතක අතරමං වීමට ඔබ කැමති කවුද? *";
    r_text [74] = " * ඔබ කවදා හෝ බැහැර කර තිබේද? මෙයට හේතුව කුමක්ද *";
    r_text [75] = " * ඔබට හැකි නම් ඔබ විසින්ම වෙනස් කරන භෞතික දේපලක් යනු කුමක්ද? *";
    r_text [76] = " * ඔබේ ජීවිතයේ නිවැරදි දෙය? *";
    r_text [77] = " * ඔබට අද්භූත හැකියාවක් ලබා ගත හැකි නම්, එය කුමක් විය හැකිද? *";
    r_text [78] = " * ඔබ ඔවුන්ට ආදරය කරන කෙනෙකු පෙන්වන්නේ කෙසේද? *";
    r_text [79] = " * ඔබේ ළමා කාලය කෙසේද? *";
    r_text [80] = " * වචනයක් උත්පාදනය කර එහි තේරුම කියන්න *";
    r_text [81] = " * ඔබ හාස්කම් විශ්වාස කරනවාද? *";
    r_text [82] = " * ඔබව වඩාත්ම කලබලයට පත් කරන්නේ කුමක් ද? *";
    r_text [83] = " * ඔබේ ජීවිතයේ ඔබට අමතක නොවන කෙනෙකු සිටීද? *";
    r_text [84] = " * ඔබට පච්චයක් කොටා ගැනීමට අවශ්‍ය නම් ඔබ කුමක් කරන්නේද? *";
    r_text [85] = " * ඔබට කාල යන්ත්‍රයක් තිබුනේ නම් සහ ආපසු ගොස් ඔබ කළ එක් දෙයක් මකා දැමිය හැකි නම්, ඔබ කුමක් මකනවාද? *";
    r_text [86] = " *ඔවුන් ඔබව සහ ඔබේ ආදරවන්තියව වහල්භාවයට ගෙන ගියා නම් ඔබ තෝරා ගන්නේ කාවද?
    r_text [87] = " * ඔබට හැඩ වෙනස් කිරීමේ හැකියාවක් තිබුනේ නම්, ඔබ මුලින්ම කුමක් බවට පත් වන්නේද? *";
    r_text [88] = " * ඔබට කවදා හෝ පෙම්වතියක් සිටියාද? *";
    r_text [89] = " * ඔබ මිනිසුන්ගෙන් toත් වීමට කැමතිද? *";
    r_text [90] = " * රාත්‍රිය හෝ දවාල? *";
    r_text [91] = " * ඔබට මිනිසුන්ගේ සිතුවිලි කියවීමට හැකි නම්, ඔබ මුලින්ම කියවන්නේ කාගේද? *";
    r_text [92] = " * ඔබට විශේෂ කෙනෙක්ට ඔබ ලොකු බොරුවක් කිව්වාද? *";
    r_text [93] = " * ඔබට මෙම කණ්ඩායමේ කෙනෙකු සමඟ දිනාය හැකි නම් ඒ කවුද? *";
    r_text [94] = " * මෙම කණ්ඩායමේ ඔබට වැඩිපුර ආදරය කරන්නේ කවුරුන් යැයි ඔබ සිතනවාද? *";
    r_text [95] = " * ඔබ තනිව සිටින විට ඔබට මොන වගේ සිහින ද? *";
    r_text [96] = " * වැසි සහිත සරත් සෘතුවේ සන්ධ්‍යාවක් හෝ හිම සහිත ශීත සෘතු රාත්‍රියක්? *";
    r_text [97] = " * මෙම කණ්ඩායම තුළ ඔබට වඩාත් සමීපව දැනෙන්නේ කාටද? *";
    r_text [98] = " * මෙම කණ්ඩායමේ සැම දෙනාම අනතුරේ! ඔබට ඇත්තේ එක් අයෙකු බේරා ගැනීමට ඇත්තේ එක් අවස්ථාවක් පමණි. ඉතිරි අයට දිවි ගලවා ගැනීමේ 40% ක අවස්ථාවක් ඇත. ඔබ කාවද බේරා ගන්නේ? *";
    r_text [99] = " * ඔබට තම ආදරය පාපොච්චාරණය කළ කෙනෙකු ඔබ කවදා හෝ ප්‍රතික්ෂේප කර තිබේද? එසේ නම් ඔවුන්ගේ නම කුමක්ද? *";
    r_text [100] = " * තාත්තාද නැත්නම් යාලුවාද? *";
    r_text [101] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබ මීට පෙර කිසිවෙකු රවටා තිබේද *";
    r_text [102] = " * පාපොච්චාරණ කාලය! ඔබ ඔබේ පෞද්ගලික තොරතුරු වෙනත් කෙනෙකු සමඟ බෙදාගෙන තිබේද? *";
    r_text [103] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබ රාත්‍රියේදී රහසිගතව සිතන කෙනෙකු සිටීද? එසේ නම් ඔවුන්ගේ නම කුමක්ද? *";
    r_text [104] = " * පාපොච්චාරණය කිරීමට කාලයයි! මීට පෙර ඔබ කවදා හෝ ඔබේ හදවතේ ඔබේ ආදරය තැන්පත් කර තිබේද *";
    r_text [105] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබට ආදරය කළ හැකි මෙම කණ්ඩායමේ සිටින්නේ කවුද *";
    r_text [106] = " * පාපොච්චාරණය කිරීමට කාලයයි! ඔබේ හොඳම මිතුරා ඔබේ සිහින පෙම්වතා වෙනුවෙන් අත්හරිනවාද? *";
    r_text [107] = " * පාපොච්චාරණය කිරීමට කාලයයි! ශරීරය සහ ආකර්ෂණය අනුව මෙම කණ්ඩායමේ ඔබ කැමතිම පුද්ගලයා කවුද? *";
    r_text [108] = " * ඔබ කොටු වී ඇත! ඉක්මනින් ප්‍රතිචාර දක්වන්න! ඔබේ පවුල හැර ගොස් ඔබට වඩාත්ම අවශ්‍ය පුද්ගලයා වෙත යාමට හෝ ඔබට 40 වන තෙක් ඔබේ පවුලේ නිවසේ සිටීමට? *";
    r_text [109] = " * ඔබ කොටු වී ඇත! තුවක්කුවක් හිසට සහ හිසට හෝ ඔබේ ජීවිතයට හෝ ඔබේ පවුලේ අයගේ ජීවිතයට එල්ල කර ඇත. ඔබ තෝරා ගන්නේ කුමක් ද? *";
    r_text [110] = " * උගුලට හසු වී ඇත! ඔබට කැත, නමුත් පොහොසත් පුද්ගලයෙක් හෝ ලස්සන නමුත් දුප්පත් පුද්ගලයෙක් හමුවීමට අවශ්‍යද? *";
    r_text [111] = " * ජෝකර් ප්‍රශ්නය! මෙම ප්‍රශ්නය අසන්නට ඔබ ඉතා වාසනාවන්ත බව එයින් පෙන්නුම් කෙරේ. මෙන්න ඔබට මගේ ප්‍රශ්නය: \ n ආදරය හෝ මුදල් ද? *";

    var i = Math.floor(112*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'challengesuro', fromMe: true, desc: SURO.challenge}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *මම ඔබට අමාරුම ප්‍රශ්න තෝරා ගනිමි ..* 😈 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
   r_text [0] = " * කෙනෙකු සමඟ දිනායනය කිරීමේදී ඔබ කළ වඩාත්ම අපහසුතාවයට පත් වූ දෙය කුමක්ද *";
    r_text [1] = " * පොදු ප්‍රවාහන සේවාවේදී ඔබ කළ වඩාත්ම විකාර සහගත දෙය කුමක්ද *";
    r_text [2] = " * ඔබ වෙනත් කෙනෙකුට පැවසූ කeරතම දෙය කුමක්ද? *";
    r_text [3] = " * එයින් ප්‍රතිවිපාක නැති බව ඔබ දැන සිටියා නම් ඔබ කුමක් කරන්නද? *";
    r_text [4] = " * ඔබ ඔබේ මිතුරන් සමඟ කිරීමට කැමති නමුත් ඔබේ පෙම්වතිය ඉදිරියේ කිසි දිනෙක නොකළ යුතු දේ කුමක්ද? *";
    r_text [5] = " * මේ ජීවිතයේ ඔබ වඩාත් ඊර්ෂ්‍යා කරන්නේ කවුද? *";
    r_text [6] = " * ආදරය සඳහා මම ඕනෑම දෙයක් කරන්නෙමි, නමුත් එය නොකරනවා යැයි ඔබ කියන්නේ කුමක්ද? *";
    r_text [7] = " * ඔබට විවිධ මිථ්‍යා විශ්වාස තිබේද? එසේ නම් ඒවා මොනවාද? *";
    r_text [8] = " * ඔබ එයට ආදරය කළ බව පිළිගැනීමට ඔබ ලැජ්ජා වන්නේ කුමන චිත්‍රපටය ද? *";
    r_text [9] = " * ඔබ අපහසුතාවයට පත් කරන ස්වයං රැකවරණ පුරුද්ද කුමක්ද? *";
    r_text [10] = " * කිසිවෙකු නොදන්නා බවට ඔබට සහතික වුවහොත් ඔබට කාව මරා දැමීමට අවශ්‍යද? *";
    r_text [11] = " * ඔබ වෙනකෙකු සඳහා මිලදී ගත් ලාභම තෑග්ග කුමක්ද? *";
    r_text [12] = " * ඔබ කවදා හෝ ප්‍රසිද්ධියේ නිරුවත් වී තිබේද? *";
    r_text [13] = " * ඔබ කවදා හෝ ප්‍රසිද්ධියේ ඔබේ නාසය ගන්නවාද? *";
    r_text [14] = " * ඔබ මහ රෑ කළ අපහසුතාවයට පත් වූ දෙය කුමක්ද? *";
    r_text [15] = " * නිරුවතින් සිටීම හෝ ඔබ සිතන සෑම දෙයක්ම ඔබේ කමිසයේ තිබීම? ඔබ තෝරා ගන්නේ කුමක් ද? *";
    r_text [16] = " * ඔබ කිසි විටෙකත් තටාකය තුළ මුත්‍රා කර කිසිවක් සිදු නොවූ ලෙස ක්‍රියා කර තිබේද? *";
    r_text [17] = " * මෙම කණ්ඩායමේ නරකම ඇඳුමින් සැරසී සිටින්නේ කවුදැයි ඔබ සිතන්නේද? *";
    r_text [18] = " * මෙම කාමරයේ සිටින මිනිසුන්ගෙන් ඔබ ඔබේ ජීවිතය වෙනස් කිරීමට කැමති ඇයි? ඇයි? *";
    r_text [19] = " * ඔබ වැසිකිළියේ හිඳගෙන සිටින විට ඔබට සිතෙන්නේ කුමක්ද? *";
    r_text [20] = " * ඔබ එය කරන විට ලැජ්ජාවට පත් වන ඔබේ අපහසුතාවයට පත් වන රසය කුමක්ද *";
    r_text [21] = " *ඔබට ඔබේ නාසය තෝරා ගත හැකිද? *";
    r_text [22] = " *ඔබ වඩාත් අපහසුතාවයට පත් වූ මොහොත *";
    r_text [23] = " *ඔබ කවදා හෝ පන්තියේදී හයියෙන් හted නඟා තිබේද *";
    r_text [24] = " *ඔබ කවදා හෝ ඔබ ගැන සරාගී ඡායාරූපයක් ගැනීමට උත්සාහ කර තිබේද? *";
    r_text [25] = " *ඔබේ රහසිගත ආශාව කවුද? *";
    r_text [26] = " *නොකළ යුතු දෙයක් කරමින් ඔබ කිසි දිනෙක හසු වී තිබේද? එසේ නම් ඔබ කළේ කුමක්ද *";
    r_text [27] = " * මෙම කාමරයේ උණුසුම්ම පුද්ගලයා කවුදැයි ඔබ සිතනවාද? *";
    r_text [28] = " * ඔබ ඔබේ වර්තමාන පෙම්වතිය හා විවාහ වනු ඇතැයි ඔබ සිතනවාද? *";
    r_text [29] = " * ඔබ ගැන කිසිවෙකු නොදන්නා කරුණ කුමක්ද? *";
    r_text [30] = " * ඔබට නොතිබිය යුතු චිත්‍රපටයක් ඔබ කවදා හෝ නැරඹුවාද? එසේ කළා නම් එහි නම කුමක්ද? *";
    r_text [31] = " * ඔබ කළ නීති විරෝධී දේ කුමක්ද? *";
    r_text [32] = " * ඔබේ සහෝදරයා තවත් සහෝදරයෙකුට ටීඑල් මිලියනයකට හුවමාරු කර ගන්නවාද? *";
    r_text [33] = " * ඔබට එක් පුද්ගලයෙකුට වඩා විවාහ වීමට හැකි නම්, ඔබ තෝරා ගන්නේ කාවද? *";
    r_text [34] = " * මෙම කණ්ඩායමේ නරකම පුද්ගලයා කවුරු විය හැකි යැයි ඔබ සිතනවාද? *";
    r_text [35] = " * ඔබේ පෙම්වතිය සමඟ වෙන්වීම සඳහා යමෙකු ඔබට ටීඑල් මිලියනයක් ලබා දුන්නේ නම් ඔබ යන්නවාද? *";
    r_text [36] = " * ඔබේ සහකරු ඔබව අපහසුතාවයට පත් කළාද? එසේ නම් එය කුමක්ද? *";
    r_text [37] = " * ඔබේ පෙම්වතියට වංචා කිරීමට ඔබ කවදා හෝ සිතුවාද *";
    r_text [38] = " * ඔබ කිසිවෙකු ඔත්තු බැලීමේදී හසු වී තිබේද? *";
    r_text [39] = " * ඔබ කිසි විටෙකත් ඔබේ නාසය තෝරාගෙන හසු වී තිබේද? *";
    r_text [40] = " * ඔබ කවදා හෝ පසුතැවෙන යමක් සමාජ මාධ්‍ය තුළ හුවමාරු කර ගත්තාද? එසේ නම් එය කුමක් ගැනද? *";
    r_text [41] = " * ඔබ ස්නානය කිරීමේදී මුත්‍රා කරනවාද? *";
  r_text [42] = " * මේස් මාරු කිරීමේදී ඔබේ දෙපා සුවඳ දැනෙනවාද? *";
    r_text [43] = " * ඔබේ ජීවිතයේ වඩාත්ම අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද? *";
    r_text [44] = " * ලෝකයේ ධනවත්ම පුද්ගලයා වීමට යමෙකු ඔබට යෝජනා කළත් ඔබ කිසි දිනෙක නොකරන එක් දෙයක් කුමක්ද? *";
    r_text [45] = " * මෙම කණ්ඩායමෙන් ඔබ කවුරුන්ද හමුවීමට කැමති? *";
    r_text [46] = " * මෙම කණ්ඩායමේ නරකම පෙම්වතිය කවුරු යැයි ඔබ සිතනවාද? *";
    r_text [47] = " * ඔබ කවදා හෝ ඔබේ පෙම්වතියගේ මිතුරා සමඟ ආදරයෙන් බැඳී තිබේද? *";
    r_text [48] = " * ඔබේ ජීවිතයේ ඔබ කළ නපුරු ක්‍රියාව කුමක්ද *";
    r_text [49] = " * ඔබ යමෙකුට කළ වඩාත්ම පිළිකුල් සහගත විහිළුව කුමක්ද? *";
    r_text [50] = " * ඔබේ පෙම්වතිය සමඟ ඔබට කිරීමට අවශ්‍ය වඩාත්ම විකාර සහගත දෙය කුමක්ද? *";
    r_text [51] = " * වෙනත් කෙනෙකුගේ බලපෑමට ලක් වූ ඔබ කළ වඩාත්ම විකාර සහගත දෙය කුමක්ද *";
    r_text [52] = " * නිරුවතින් සිටීම හෝ ඔබේ හිස මත සිතුවිලි ලිවීම යන දෙකෙන් එකක් තෝරා ගැනීමට ඔබට සිදු වුවහොත් ඔබ තෝරා ගන්නේ කුමක්ද? *";
    r_text [53] = " * ඔබ මීට පෙර ඔබේ සෙවල රස බැලුවාද? *";
    r_text [54] = " * වැසිකිළියේ වාඩි වී සිටියදී ඔබ සිතන්නේ මොනවාද?";
    r_text [55] = " * ඔබ කොටසක් වූ වඩාත්ම අපහසුතාවයට පත් වූ තත්ත්වය කුමක්ද? *";
    r_text [56] = " * ඔබේ වඩාත්ම අපහසුතාවයට පත් වන පුරුද්ද කුමක්ද? *";
    r_text [57] = " * ඔබ මීට පෙර කවදාවත් ඒ යටතේ මුත්‍රා කර තිබේද *";
    r_text [58] = " * ප්‍රසිද්ධියේ ඔබ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කුමක්ද *";
    r_text [59] = " * මිනිසුන්ට අහිතකර විය හැකි වුවත්, ඔබේ ප්‍රියතම දේ කුමක්ද? *";
    r_text [60] = " * ඔබ රහසිගතව උනන්දු වන්නේ කවුරුන්ද? *";
    r_text [61] = " * 1-10 පරිමාණයෙන් ඔබේ පෙනුම ඔබ තක්සේරු කරන්නේ කෙසේද? *";
    r_text [62] = " * ඔබ අහම්බෙන් මිතුරෙකුගේ රහසක් හෙළි කළාද? එසේ නම් එය කුමක්ද? *";
    r_text [63] = " * ඔබ ඔබේ වර්තමාන පෙම්වතිය/පෙම්වතා සමඟ විවාහ වනු ඇතැයි ඔබ සිතනවාද? *";
    r_text [64] = " * ඔබ කවදා හෝ කන් පෙත්තක් රස බැලුවාද? *";
    r_text [65] = " * ඔබ කවදා හෝ ඔබේ දහඩිය රස බැලුවාද? *";
    r_text [66] = " * ඔබ දන්නා නරකම පුද්ගලයා ඔබ යැයි විශ්වාස කරන මෙම කණ්ඩායමේ පුද්ගලයා කවුද? *";
    r_text [67] = " * ආදරය කරන කෙනෙකු ඉදිරියේ ඔබ පැවසූ හෝ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [68] = " * යථාර්ථවාදී නොවන ඔබේ ලොකුම බිය කුමක්ද? *";
    r_text [69] = " * ඔබේ තැලීම ඉදිරියේ වඩාත් අපහසුතාවයට පත් වූ අවස්ථාව කවදා ද? *";
    r_text [70] = " * ඔබ අවසන් වරට ඔබේ ඇඳ තෙත් කළේ කවදාද? *";
    r_text [71] = " * කිසිවෙකු නොදන්නා ඔබේ ලොකුම රහස කුමක්ද? *";
    r_text [72] = " * ඔබව සරාගී කර ගැනීමට ඔබ කරන්නේ කුමක්ද? *";
    r_text [73] = " * ඔබව වැඩිපුරම යොමු කරන්නේ කුමක් ද? *";
    r_text [74] = " * ඔබට වෙනත් කෙනෙකුගේ පෙම්වතියක් සමඟ එළියට යාමට හැකි නම්, ඒ කවුරුන්ද? *";
    r_text [75] = " * ඔබ ආදරය කළ පුද්ගලයාට පණිවිඩයක් යැවීමට ඔබට හැකි නම් එය කුමක් විය හැකිද? *";
    r_text [76] = " * ඔබට මෙම කණ්ඩායමේ එක් අයෙකු හා විවාහ විය හැකි නම් ඒ කවුරුන්ද? *";

    var i = Math.floor(77*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'sexsuro', fromMe: true, desc: SURO.sex}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' 💋 *ඔබ සූදානම්ද* 👅 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}

        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
    r_text [0] = " * ඔබට මෙම කණ්ඩායමේ විරුද්ධ ලිංගයේ අයෙකු සමඟ නිදා ගැනීමට හැකි නම්, ඒ කවුරුන්ද? *";
    r_text [1] = " * ඔබට විකල්ප දෙකක් ඇත, ඔබට වසර 1 ක් ලිංගික වහලෙකු වීමට හෝ ඔබේ ලිංගික අවයව වලට නරක ශල්‍යකර්මයක් කිරීමට අවශ්‍යද? *";
    r_text [2] = " * ඔබ නිරුවත් යැයි ඔබ සිතනවාද? *";
    r_text [3] = " * ඔබ කුමන කීර්තිමත් පුද්ගලයෙක් සමඟ ලිංගිකව හැසිරීමට කැමතිද? *";
    r_text [4] = " * ඔබ ලිංගිකව එක් වූ අසාමාන්‍ය ස්ථානය කොහෙද? *";
    r_text [5] = " * ඔබ අවසන් වරට ස්වයං වින්දනය කළේ කවදාද? *";
    r_text [6] = " * ඔබව ස්පර්ශ කිරීමේදී ඔබට හැඟෙන්නේ කෙසේද? *";
    r_text [7] = " * ඔබ වෙනත් යුවළක් ලිංගිකව හැසිරෙන අයුරු දැක තිබේද? *";
    r_text [8] = " * යමෙක් ඔබට පැවසූ සරාගී දේ මොනවාද? *";
    r_text [9] = " * ඔබ කවදා හෝ කැඩපත තුළින් ඔබේ ශරීරය දෙස බලා දවල් සිහින දැක තිබේද? *";
    r_text [10] = " * ඔබට කවදා හෝ එක් රාත්‍රී භෝජන සංග්‍රහයක් තිබේද *";
    r_text [11] = " * ඔබ නිරුවත් කළාද? *";
    r_text [12] = " * ඔබේ ගුරුවරයා ගැන ඔබ සිහින මැව්වාද? *";
    r_text [13] = " * ඔබ සතුටක් ලබා දීමට හෝ ලබා ගැනීමට කැමතිද? *";
    r_text [14] = " * ඔබ කිසි විටෙකත් නොකරන ලිංගික ක්‍රියාවක් යැයි කියන්න. *";
    r_text [15] = " * නව යොවුන් වියේදී ඔබ අල්ලා ගත් ඉතාම අසභ්‍ය දේ? *";
    r_text [16] = " * ඔබේ ජීවිතයේ ඔබට ලිංගික සහකරුවන් කී දෙනෙක් සිටියාද *";
    r_text [17] = " * ඔබට ඔබේ පළමු වින්දනය ලබා දුන්නේ කවුද? *";
    r_text [18] = " * ඔබ කවදා හෝ කෙනෙකුගේ කන්‍යාභාවය බිඳ දමා තිබේද? *";
    r_text [19] = " * ඔබ කැමති කාමුක දර්ශන වර්ගය කුමක්ද? *";
    r_text [20] = " * ඔබ කවදා හෝ පොදු වැසිකිලියක ස්වයං වින්දනයේ යෙදී තිබේද? *";
    r_text [21] = " * ඔබ කවදා හෝ ලිංගික සෙල්ලම් බඩුවක් භාවිතා කර තිබේද? *";
    r_text [22] = " * ඔබ කවදා හෝ ගුද ලිංගික සංසර්ගය සඳහා උත්සාහ කර තිබේද? *";
    r_text [23] = " * වෙනත් කෙනෙක් ඔබේ සිරුරට අත තැබුවොත් ඔබට ගින්නක් ඇති වෙනවාද? *";
    r_text [24] = " * යමෙකු තුළ ලිංගික ආකර්ෂණීය බවක් ඔබ දකින පළමු දෙය කුමක්ද? *";
    r_text [25] = " * ඔබ ස්වයං වින්දනය කළ අමුතුම තැන කොහේද? *";
    r_text [26] = " *ඔබේ ලිංගික මනාපය කුමක්ද? *";
    r_text [27] = " * ඔබේ ලිංගික ආශාව කෙතරම් ඉහළ ද? *";
    r_text [28] = " * ඔබ පහර දීමට කැමතිද? *";
    r_text [29] = " * ඔබව කුපිත කිරීමට ඇති විශ්වාසදායක ක්‍රමය කුමක්ද? *";
    r_text [30] = " * ඔබ අපිරිසිදු කතා වලට කැමතිද? *";
    r_text [31] = " * ඔබ කැමතිද ඉහළට හෝ පහළට වීමට? *";
    r_text [32] = " * ඔබ ලිංගික අවයවයක් ඇති කර ගැනීම සඳහා ඔබ යමෙකු සිප ගන්නේ කොතැනද? *";
    r_text [33] = " * විරුද්ධ ලිංගයේ අයගෙන් ඔබ ලිංගික සංසර්ගය ඇති කරන්නේ කෙසේද? *";
    r_text [34] = " * ඔබේ පළමු හාදුව විස්තර කරන්න. *";
    r_text [35] = " * ඔබ කී දෙනෙක් සමඟ ලිංගිකව හැසිරී තිබේද? *";
    r_text [36] = " * ඔබ කා සමඟද මුලින්ම ලිංගික සංසර්ගය කළේ? එය හොඳද? *";
    r_text [37] = " * ඔබ කවදා හෝ ලිංගිකව හැසිරීමට හසු වී තිබේද? *";
    r_text [38] = " * ඔබට ශිෂේණය හෝ යෝනි මාර්ගය තිබේ නම් ඔබ මුලින්ම කුමක් කරන්නේද";
    r_text [39] = " * ලිංගිකත්වය ගැන මෙතෙක් ඔබේ අදහස කුමක්ද? *";
    r_text [40] = " * ඔබේ ශරීරය ගැන ඔබ තෘප්තිමත්ද? *";
    r_text [41] = " * ඔබ පිරිමියෙක් නම් ඔබේ ලිංගේන්ද්‍රියේ ප්‍රමාණය සහ හැඩය විස්තර කරන්න. ඔබ එයින් තෘප්තිමත්ද? *";
    r_text [42] = " * ඔබ ඔබේම ශුක්‍රාණු රස බැලුවාද? ඔබ එයට කැමතිද? *";
    r_text [43] = " * ඔබේ වඩාත්ම අසාමාන්‍ය / තහනම් මන fකල්පිතයන් විස්තර කරන්න. *";
    r_text [44] = " * ඔබ සිහින මැවූ අමුතුම පුද්ගලයා කවුද? *";
    r_text [45] = " * ස්වයං වින්දනයේ යෙදෙන විට ඔබ නිතරම සිහින දකිනවාද? *";
    r_text [46] = " * ඔබේ අමුතුම පුරුද්ද කුමක්ද? *";
    r_text [47] = " * ඔබට ලැජ්ජාව පිළිබඳ අදහසක් තිබේද? එසේ නම් එය කුමක්ද? *";
    r_text [48] = " * ඔබ හිස් වන විට ඔබට හැඟෙන්නේ කෙසේද? *";
    r_text [49] = " * ඔබ ශුක්‍රාණු පිට කරන විට කෙදිනක හෝ හුස්ම හෙළනවාද? *";
  r_text [50] = " * ඔබේ ලිංගික අවයව ස්පර්ශ නොකර ඔබට ලිංගික සංසර්ගය කළ හැකිද? *";
    r_text [51] = " * ඔබේ තන පුඩු කෙතරම් සංවේදීද? ඔබ ඔබේ තන පුඩු සමඟ සෙල්ලම් කරනවාද? *";
    r_text [52] = " * ඔබට වෙනත් පුද්ගලයෙකු සමඟ හෝ ස්වයං වින්දනය තුළින් ලිංගික සංසර්ගය පහසු කර ගත හැකිද? *";
    r_text [53] = " * දෘඩ හෝ මෘදු සම්බන්ධතාවයකින් හිස් කිරීමට පහසු කුමක්ද? *";
    r_text [54] = " * ඔබ ඔබේ සහකරු සමඟ කළ ලැජ්ජා සහගතම දෙය කුමක්ද? *";
    r_text [55] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n ඔබව හැරවන ඔබේ පෙම්වතියගේ සරාගී කොටස කුමක්ද?*";
    r_text [56] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි!*\ n ඔබට ඔබේ සමීපතම විරුද්ධ ලිංගයේ ඥාති සහෝදරයෙකු සමඟ ලිංගිකව හැසිරීමට අවශ්‍යද?*";
    r_text [57] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n මෙම කණ්ඩායමේ විරුද්ධ ලිංගයේ අයෙකු නිරුවතින් දැකීමට ඔබට අවස්ථාවක් තිබේ! ඔබ කාවද බලන්න කැමති?*";
    r_text [58] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n මැසොචිස්ටික් හා සරාගී පෙම්වතියක් සමඟ උණුසුම් රාත්‍රීන් හෝ ඔබට වඩා සාමාන්‍ය හා අඩු සරාගී පුද්ගලයෙකු සමඟ උණුසුම් රාත්‍රීන්?*";
    r_text [59] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි!*\ n ඔබට මෙම කණ්ඩායමේ කෙනෙකුගේ නිරුවත් ඡායාරූපයක් දැක ගත හැකි නමුත් මාස 1 ක් ස්වයං වින්දනයේ යෙදෙන්නේ නැත. කෙසේ හෝ එය දැකීමට ඔබ කැමතිද?*" ;
    r_text [60] = "*මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි!*\ n පිරිමින් සඳහා; ඔබට එක් රාත්‍රී විවේකයක් සඳහා අයිතියක් ඇති අතර ඔබට තේරීම් දෙකක් තිබේ: ලානා රෝඩ්ස් හෝ බරබර පැල්වින් \ n ගැහැණු ළමයින් සඳහා; ජොනී සින්ස් හෝ ජෝර්ඩි?*" ;
    r_text [61] = "*ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුය!*\ n මෙම කණ්ඩායමේ ඔබ බලාපොරොත්තු සහිත සිහින කා සමඟද?*";
    r_text [62] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔවුන් ඔබට මිනිසෙකු තරම් යථාර්ථවාදී සුපිරි සරාගී රොබෝ යන්ත්‍රයක් ලබා දෙන නමුත් ඔබට මසකට වරක් පමණක් ලිංගිකව හැසිරීමට හෝ මධ්‍යම ආකර්ෂණීය පුද්ගලයෙකු සමඟ ලිංගිකව හැසිරීමට හැකි වේ ඔබට අවශ්‍යයි. ඔබ තෝරා ගන්නේ කුමක් ද? ";
    r_text [63] = " *මෙම ප්‍රශ්නයට ඔබ පිළිතුරු දිය යුතුයි! *\ n ඔබේ සිහින හාදුව දර්ශනය සහ ඔබට එය කිරීමට අවශ්‍ය කවුරුන්ද යන්න විස්තර කරන්න.";
    r_text [64] = " *ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි! *\ n ඔබට අනපේක්ෂිත ලෙස ලිංගික සංසර්ගයක් ඇති වුනාද?";
    r_text [65] = " *ඔබට මෙම ප්‍රශ්නයට පිළිතුරු දිය යුතුයි! *\ n ඔබට එකවර පුද්ගලයන් කිහිප දෙනෙකුට වඩා බලපෑම් කර තිබේද?";

    var i = Math.floor(66*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
        MessageType.text
    );

    }));

    Asena.addCommand({pattern: 'lgbtsuro', fromMe: true, desc: SURO.lgbt}, (async (message, match) => {

        if (!message.reply_message) return await message.client.sendMessage(message.jid,rep, MessageType.text);

        await message.client.sendMessage(message.jid, '@' + message.reply_message.jid.split('@')[0] + ' *කරදර එනවා ..* 🏳️‍🌈 ', MessageType.text, {
            quotedMessage: message.reply_message.data, contextInfo: {mentionedJid: [message.reply_message.jid.replace('c.us', 's.whatsapp.net')]}
        });

        await new Promise(r => setTimeout(r, 2100));

        var r_text = new Array ();
    r_text [0] = " * ඔබේ එකම ලිංගය ගැන +18 දේවල් ගැන ඔබ කවදාවත් සිතුවාද? *";
    r_text [1] = " * ඔබට ඔබේ සමලිංගිකයින් සමඟ පමණක් ලිංගිකව හැසිරීමට හැකි නම්, ඔබ මෙම කණ්ඩායම තුළ එය කරන්නේ කා සමඟද *";
    r_text [2] = " * ඔබ කරන දේවල් හෝ කතා කරන විදිහ නිසා ඔබ Trance යැයි ඔබ සැලකුවාද? *";
    r_text [3] = " * ඔබ මෙම කණ්ඩායමේ ඔබේ සමාන ලිංගය සමඟ සම්බන්ධතාවක් තිබුනේ නම්, ඔබ කා සමඟද? *";
    r_text [4] = " * ඔබ දේදුනු පාටට කැමතිද? *";
    r_text [5] = " * ඔබ LGBT අක්ෂර සමඟ ක්‍රීඩා කිරීමෙන් සතුටක් ලබනවාද? *";
    r_text [6] = " * ඔබට දින 1 ක් තවත් සමලිංගික පුද්ගලයෙක් බවට පරිවර්තනය වීමට හැකි නම් ඒ කවුරුන්ද? *";
    r_text [7] = " * ඔබේ මිතුරන් අතර ඔබට වඩා එල්ජීබීටී වීමට වැඩි ඉඩක් ඇත්තේ කවුද? *";
    r_text [8] = " * ඔබ ලෝකයේ ධනවත්ම පුද්ගලයා වන නමුත් සමලිංගික සහකරුවෙකු සිටී නම් හෝ දුප්පත් නමුත් විරුද්ධ ලිංගයේ සහකරුවෙකු සිටියත් ඔබ තෝරා ගන්නේ කුමක්ද? *";
    r_text [9] = " * ඔබේ සමලිංගික පුරුෂ භාවය තුළ ඔබ ගත කරන එක් රැයක් සඳහා ඩොලර් මිලියනයක මුදලක් ඔබට ලැබෙනු ඇත. නමුත් මෙම මුදල් පවතින්නේ දින 3 ක් පමණි. එය නැවත ලබා ගැනීම සඳහා ඔබ නැවත ලිංගිකව එකතු වේද? *";
    r_text [10] = " * ඔබ මෙම ශරීරයට අයත් නොවන බව ඔබට කවදා හෝ දැනී තිබේද? *";
    r_text [11] = " * ඔබ ඔබේ ආදරය පාපොච්චාරණය කරන්නේ නම්, ඔබ එය කවරෙකුට කියන්නේද? *";
    r_text [12] = " * දේදුනු වර්ණ ඇඳුමක් ඇඳීමට ඔබ බියද? *";
    r_text [13] = " * සාමාන්‍ය හෝ සමලිංගික සබඳතා වඩාත් ප්‍රියජනක යැයි ඔබ සිතනවාද? *";
    r_text [14] = " * LGBT පුද්ගලයින් ගැන ඔබේ අදහස කුමක්ද? *";
    r_text [15] = " * ඔබ සමාජ මාධ්‍ය ඔස්සේ LGBT පුද්ගලයින් අනුගමනය කරනවාද? *";
    r_text [16] = " * ඔබට එකම සමලිංගික පුරුෂයෙකුට පමණක් දින යා හැකි නම් ඒ කවුරුන්ද *";
    r_text [17] = " * ඔබ ගැහැණු ළමයෙක්/පිරිමි ළමයෙක් වේ යැයි ඔබ කවදා හෝ කැමති වූවාද? *";
    r_text [18] = " * ඔබ විරුද්ධ ලිංගයේ ඇඳුම් ඇඳීමට කැමතිද? එය ඔබට ගැලපේ යැයි ඔබ සිතනවාද? *";
    r_text [19] = " * පීඩනයක් සහ 100% ස්ත්‍රී පුරුෂ භාවය නැවත පැවරීමේ සැත්කමක් නොමැති නම් ඔබ එය කරන්නද? *";
    r_text [20] = " * ඔබේ සහකරු ඔබ ඇඳගෙන යන ඇඳුම් මොනවාද? *";
    r_text [21] = " * වසර ගණනාවක සිට ඔබේ හොඳම මිතුරා සහ ඔබ සමඟ සිටින කෙනෙකු ඔබ ගැන උනන්දුවක් දැක්වීමට පටන් ගෙන ඇත. ඔබ ඔහුව ඔබේ ජීවිතයෙන් ඉවත් කර ගන්නවාද *";
    r_text [22] = " * ඔබේ සෙසු මිනිසා ඔබට ඔහුගේ ආදරය පාපොච්චාරණය කළහොත් ඔබේ පළමු ප්‍රතිචාරය සහ ඔබේ ඊළඟ ප්‍රතික්‍රියාව කුමක්ද *";
    r_text [23] = " * ඔබ ලීරා 200 ක් සඳහා දින 1 ක් එල්ජීබීටී ධජයක් සහිත හිස් ආවරණයක් පළඳින්නේද? *";
    r_text [24] = " * ඔබ ඔබේ සමලිංගික සේවනයම ටීඑල් 1000 කට තොල් මත සිපගන්නවාද? එපමණක් නොව, ඔබ මෙය කරන සෑම අවස්ථාවකම ඔබට ටීඑල් 1000 ක් ලැබේ. ඔබ එය තවත් කරනවාද? *";
    r_text [25] = " * ඔබේ හොඳම මිතුරා ඔබව හැරවීමට උත්සාහ කරයි. ඔබ මෙය සිදු වීමට ඉඩ දෙනවාද? *";
    r_text [26] = " * ඔබ ඔබේ සෙසු මිනිසා සමඟ දැඩි උණුසුම් වාතාවරණයක් නිර්මාණය කර ඇත. ඔබට පාලනය අහිමි වෙමින් පවතී .. ඔබ එය භුක්ති විඳ එයට ගලා යාමට සලස්වනවාද නැත්නම් ඔබ නවත්වන්න යැයි කීවොත් *";
    r_text [27] = " * විරුද්ධ ලිංගයේ අය ඔබට ඔබේ සමලිංගික සේවනයට වඩා බොහෝ සෙයින් ආදරය හා සෙනෙහස ලබා දෙයි. ඔබ දෙදෙනාටම අවස්ථාවක් ඇතැයි ඔබ සිතනවාද? *";
    var i = Math.floor(27*Math.random())

    await message.client.sendMessage(
        message.jid,
        `${r_text[i]}`,
         MessageType.text
    );

    }));
}
